Repository: RobertOfTaiwan/SudokuStudyLib
Catalog: docs/source/locale/*/LC_MESSAGES/courses.po
Languages: fr, ja, zh_cn, zh_tw

source: Courses
fr: cours
ja: レッスンプラン
zh_cn: 课程计画
zh_tw: 課程計畫

source: We can arrange these courses as a sudoku summer camp. We can prepare 1-6 different level sudokus. The learners don't need to learn all levels. The purpose of these courses is NOT to teach all solving methods of sudoku, its purpose is logic learning. So, we can let different learners have their suitable target to learn.
fr: Nous pouvons organiser ces cours comme un camp d'été de sudoku. Nous pouvons préparer 1-6 sudokus de niveau différents. Les apprenants n'ont pas besoin d'apprendre tous les niveaux. Le but de ces cours n'est pas d'enseigner toutes les méthodes de résolution de sudoku, son but est l'apprentissage de la logique. Donc, nous pouvons laisser différents apprenants ont leur cible appropriée à apprendre.
ja: 我々は、これらのプログラムを探索するサマーキャンプの数独ロジックを手配することができ、我々は目標を学習者がすべての数独ソリューションを学習できるようにすることはありません。対象の異なる数独の難易度の6種類を事前に手配することができますが、彼らは自分のレベルのを見つけてみましょう数独当社の目標は、数独のスキルを解決するために、それらのロジックを教えるために、私たちはさまざまな学習を行うことができ、異なる材料を使用しており、それを解決するためのロジックの精神にそれらすべてを教えることはありません。
zh_cn: 我们可以安排一个暑期数独营来上这些逻辑探索课程. 我们可以预先安排六种难易度不同的数独题目. 目标不是让学习者学会所有的数独解法, 而是让他们找到适合自己程度的数独. 我们的目标不是教他们所有的解决数独的技巧, 而是教他们逻辑. 所以, 我们可以让不同的学习者, 使用不同的教材, 并且以逻辑的精神来解决它.
zh_tw: 我們可以安排一個暑期數獨營來上這些邏輯探索課程. 我們可以預先安排六種難易度不同的數獨題目. 目標不是讓學習者學會所有的數獨解法, 而是讓他們找到適合自己程度的數獨. 我們的目標不是教他們所有的解決數獨的技巧, 而是教他們邏輯. 所以, 我們可以讓不同的學習者, 使用不同的教材, 並且以邏輯的精神來解決它.

source: Who are suitable for these courses
fr: Qui sont adaptés à ces cours
ja: 誰がこれらのコースをすべきですか？
zh_cn: 谁适合上这些课程呢?
zh_tw: 誰適合上這些課程呢?

source: Every one who have studied in an elementary school for three or four years.
fr: Chacun qui ont étudié dans une école primaire de trois ou quatre ans.
ja: コースのそれぞれが適してグレード3-4を持っていた。
zh_cn: 每一个上过小学3-4年级课程的人都适合.
zh_tw: 每一個上過小學3-4年級課程的人都適合.

source: First Step: Learn solve a sudoku by hand
fr: Première étape: savoir résoudre un sudoku à la main
ja: 最初のステップ：それ自身の独立した筆跡を作る
zh_cn: 第一步: 以手写来解数独
zh_tw: 第一步: 以手寫來解數獨

source: Hours:
fr: heures:
ja: 営業時間：
zh_cn: 时数:
zh_tw: 時數:

source: 14 hours, 2 hours/day, 7 days
fr: 14 heures, 2 heures / jour, 7 jours
ja: 14時間、7日間、2時間/日
zh_cn: 14小时, 2小时/每天, 共 7 天
zh_tw: 14小時, 2小時/每天, 共 7 天

source: Purpose:
fr: objectif:
ja: 目標：
zh_cn: 目标:
zh_tw: 目標:

source: Find the suitable level for every learner
fr: Trouver le niveau approprié pour chaque apprenant
ja: 彼は、各学習者の適切なレベルの数独を見つけてみましょう
zh_cn: 让每个学习者找到适合他程度的数独
zh_tw: 讓每個學習者找到適合他程度的數獨

source: Learn the basic computer knowledge
fr: Apprendre les connaissances de base en informatique
ja: コンピュータ基本を学ぶ
zh_cn: 学习电脑基础知识
zh_tw: 學習電腦基礎知識

source: Second Step: Learn to find methods to solve a sudoku
fr: Deuxième étape: Apprenez à trouver des méthodes pour résoudre un sudoku
ja: ステップ2：数独を解決する方法を見つけることを学びなさい
zh_cn: 第二步: 学习去发现解决数独的方法
zh_tw: 第二步: 學習去發現解決數獨的方法

source: Nameing the method that they have found a model to solving a sudoku, and write down the description.
fr: Nameing la méthode qu'ils ont trouvé un modèle pour résoudre un sudoku, et notez la description.
ja: 彼らはモデルの名前と、このモードを記述するために言葉を書き留めて、自分の言葉で、解決すべき見つけたとき。
zh_cn: 当他们发现一个模式来解决时, 用自己的语言来命名, 并且写下字句来描述此模式.
zh_tw: 當他們發現一個模式來解決時, 用自己的語言來命名, 並且寫下字句來描述此模式.

source: Let them can express their methods to others.
fr: Qu'ils puissent exprimer leurs méthodes à d'autres.
ja: 彼らは他の人に耳を傾ける博覧会の独自の方法を見つけるようにします。
zh_cn: 让他们将自己发现的方法阐述给他人听.
zh_tw: 讓他們將自己發現的方法闡述給他人聽.

source: Learn the basic python programming by solving their home work, like solving how add all the value of 1 to 100.
fr: Apprendre la programmation de python de base par la résolution de leur travail à la maison, comme la résolution de la façon ajouter toute la valeur de 1 à 100.
ja: 彼らは上のような1から100のように、Pythonの基本的なプログラムを書く、とすることを学ぶ前に、宿題を解くことから道...
zh_cn: 从解决他们以前家庭作业的方式来学习Python 基本程式的撰写, 如从1 加到100 等等...
zh_tw: 從解決他們以前家庭作業的方式來學習 Python 基本程式的撰寫, 如從 1 加到 100 等等...

source: Third Step: Learn to write python code to implement their methods
fr: Troisième étape: Apprenez à écrire du code python à mettre en œuvre leurs méthodes
ja: ステップ3：自分自身のプラクティスを見つけることがPythonプログラムを書き始める
zh_cn: 第三步: 开始撰写Python 程式来实践自己发现的方法
zh_tw: 第三步: 開始撰寫 Python 程式來實踐自己發現的方法

source: Learning Object Oriented Programming(OOP) concept.
fr: Orientée Objet Apprendre la programmation (POO) notion.
ja: コンセプトに基づいて、オブジェクト指向プログラミング（OOP）を学習する。
zh_cn: 学习物件导向程式设计(OOP)的基础观念.
zh_tw: 學習物件導向程式設計(OOP)的基礎觀念.

source: Learning to use OOP to implement their methods.
fr: Apprendre à utiliser la programmation orientée objet de mettre en œuvre leurs méthodes.
ja: 彼らが発見した方法をシミュレートするために、オブジェクト指向プログラミングを使用することを学ぶ。
zh_cn: 学习使用OOP 来模拟他们所发现的方法.
zh_tw: 學習使用 OOP 來模擬他們所發現的方法.
