Repository: RobertOfTaiwan/SudokuStudyLib
Catalog: docs/source/locale/*/LC_MESSAGES/data.po
Languages: fr, ja, zh_cn, zh_tw

source: How to make a simulator environment in Python to solve a sudoku
fr: Comment faire un environnement de simulation en Python pour résoudre un sudoku
ja: 数独は、どのようにPythonでシミュレーション環境を作るには？
zh_cn: 如何在Python 中制作一个解数独的模拟环境?
zh_tw: 如何在 Python 中製作一個解數獨的模擬環境?

source: We think classes defined is the most difficult for learner in the OOP method of programming. So in these courses of learning to solve sudoku, we don't explain how to make a class, property, and methods in detail. But just make a explanation of the existed classes, properties and methods in this library to learners. So we can explain these data structures as a simulator environment to solve a sudoku like a human being.
fr: Nous pensons que les classes définies est la plus difficile pour l'apprenant dans la méthode de la programmation orientée objet de la programmation. Donc, dans ces cours d'apprentissage pour résoudre le sudoku, nous n'expliquons pas comment faire une classe, les biens et méthodes en détail. Mais juste faire une explication de classes existent, les propriétés et méthodes de cette bibliothèque pour les apprenants. Donc, nous pouvons expliquer ces structures de données comme un environnement de simulation pour résoudre un sudoku comme un être humain.
ja: 私たちは、これらのコースでは、我々はクラス、属性およびメソッドを設計する方法を詳細に説明することが準備されていませんので、我々は両方のカテゴリでこのライブラリで説明し、クラス定義、オブジェクト指向プログラミングの最も困難な部分であると考え数独のロックを解除する方法を学ぶために考えている学習者となるよう、属性やメソッド、私たちはこれらのクラスのデータ構造アナログができ、プロパティとメソッドは、数独を解決するためのシミュレーション環境を提起した。
zh_cn: 我们认为, 类别定义, 是在OOP程式设计中最困难的部分. 所以在这些课程中, 我们不准备详细地解释如何设计类别, 属性与方法. 我们只会解说在这个程式库中既有的类别, 属性与方法. 所以我们可以类比这些类别, 属性与方法所构成的资料结构是一个解决数独的模拟环境, 以便让学习者以人的思考模式来学习如何解开一个数独.
zh_tw: 我們認為, 類別定義, 是在OOP程式設計中最困難的部分. 所以在這些課程中, 我們不準備詳細地解釋如何設計類別, 屬性與方法. 我們只會解說在這個程式庫中既有的類別, 屬性與方法. 所以我們可以類比這些類別, 屬性與方法所構成的資料結構是一個解決數獨的模擬環境, 以便讓學習者以人的思考模式來學習如何解開一個數獨.

source: We can first image that there are 9x9 houses in a beautiful valley, and they are build like:
fr: Nous pouvons première image que il ya des maisons 9x9 dans une belle vallée, et ils sont construits comme:
ja: まず、我々は美しい谷に想像することができ、家の間の9×9の正方形がある次のように、それらが配置されている。
zh_cn: 首先, 我们可以想像在一个美丽的山谷中, 有9x9 间方方正正的房子, 它们排列如下:
zh_tw: 首先, 我們可以想像在一個美麗的山谷中, 有 9x9 間方方正正的房子, 它們排列如下:

source: **An Imagined World**
fr: ** Un monde imaginaire **
ja: **イギリス虚**
zh_cn: **一个假想的联合王国**
zh_tw: **一個假想的聯合王國**

source: There are 9 countries, every country has 9 people. They decide to live together in this beautiful valley. And there are 9x9 houses, They want to let every people live in one house, and every X-way line, Y-way line, and every 3x3 box include all countries' people. And if so, they can say themselves are a real united group in the world, can you help them?
fr: Il ya 9 pays, chaque pays dispose de 9 personnes. Ils décident de vivre ensemble dans cette belle vallée. Et il ya des maisons 9x9, Ils veulent laisser tous les gens vivent dans une maison, et chaque ligne X-chemin, la ligne Y-chemin, et chaque boîte 3x3 comprennent les gens de tous les pays. Et si c'est le cas, ils peuvent dire eux-mêmes sont un vrai groupe uni dans le monde, pouvez-vous les aider?
ja: 9カ国は、谷が9×9の合計を収容しながら、それぞれの国で、彼らはこの美しい谷に定住することを決め、一緒、9人を持って、あります。彼らは、（X-ウェイライン）各行を決め、各列（Y-ウェイライン）、およびすべての3x3のブロックは、すべての国の人が含まれていますので、彼らはこのグループには、本当のイギリスで、永続的に安心して一緒に暮らすことができますし、彼らがこの目標にそれを達成するのを助けることができると思います？
zh_cn: 这里有9 个国家, 每一个国家有9 个人, 他们决定一起定居在这个美丽的山谷. 而这个山谷共有9x9 间房子. 他们决定每一排(x-way line), 每一列(y-way line ), 及每一个3x3 区块都包含了每一个国家的人. 如此, 他们才会认为他们这个团体才是一个真正的联合王国, 可以永久和平地生活在一起. 你可以帮助他们达到这个目的吗?
zh_tw: 這裡有 9 個國家, 每一個國家有 9 個人, 他們決定一起定居在這個美麗的山谷. 而這個山谷共有 9x9 間房子. 他們決定每一排(x-way line), 每一列(y-way line), 及每一個 3x3 區塊都包含了每一個國家的人. 如此, 他們才會認為他們這個團體才是一個真正的聯合王國, 可以永久和平地生活在一起. 你可以幫助他們達到這個目的嗎?

source: and then we can start to solve the wondeful world for these people...
fr: et alors nous pouvons commencer à résoudre le monde wondeful pour ces gens ...
ja: その後、我々はこの世界を良くするために、これらの人々を助けるために始めることができます...
zh_cn: 接着, 我们就可以开始协助这些人来促成这一个美好的世界...
zh_tw: 接著, 我們就可以開始協助這些人來促成這一個美好的世界...

source: What is a Class? and an Object?
fr: Qu'est-ce qu'une classe? et un objet?
ja: カテゴリとは何ですか？オブジェクトとは何ですか？
zh_cn: 什么是类别? 什么是物件?
zh_tw: 甚麼是類別? 甚麼是物件?

source: Class is collective name for a group of objects which have same behaviors, features, forms. So, animal can be a class name, and elephant is an kind of object of this class.
fr: Classe est le nom collectif pour un groupe d'objets qui ont les mêmes comportements, les caractéristiques, les formes. Donc, animal peut être un nom de classe, et l'éléphant est un type d'objet de cette classe.
ja: OOPでは、カテゴリ（クラス）が主人公のように定義されている。 、ヒトJとしてそれを探る通信したり、記録を目的とするためには、同じ動作、特性と分類されている同じものの外観を持つことになります。我々は、クラスのような動物、象、動物のカテゴリのサブカテゴリであると思いますが、1象と象は、オブジェクトの2つのタイプのいずれかに属し動物である。
zh_cn: 在OOP中，类别(class)的定义是主角。它就如同人类j为了探索、沟通或者纪录等目的，会将有同样行为、特性与外表的事物归类一样。如同我们会将动物当作一类，而大象就是动物类别的一个子类别，一只大象就是同属于动物及大象这两类的一个物件。
zh_tw: 在OOP中，類別(class)的定義是主角。它就如同人類j為了探索、溝通或者紀錄等目的，會將有同樣行為、特性與外表的事物歸類一樣。如同我們會將動物當作一類，而大象就是動物類別的一個子類別，一隻大象就是同屬於動物及大象這兩類的一個物件。

source: An object is thing which belong a class or multi classes.You can treat an object is an entity of a class, like human is a class, but you is an object, an entity which belong human class.
fr: Un objet est chose qui appartiennent une classe ou plusieurs classes.You peuvent traiter un objet est une entité d'une classe, comme l'homme est une classe, mais vous est un objet, une entité qui appartient classe humaine.
ja: 象に、自然、このオブジェクトはゾウや動物のクラスに属するが、ターゲットのニーズを見ながら、また、動物のカテゴリへの直接の対象とする象であってもよい。だから我々は、あなたがこのカテゴリー内の単一の独立したオブジェクトに接続されているだけで、人間の範疇かのように、私たちの本当のオブジェクト指向プログラミングは、世界のエンティティオブジェクト（オブジェクト）の中で述べていることを言うことができます。
zh_cn: 虽然在自然上，一只大象这个物件同时隶属于大象类及动物类，但看目标的需要，也可以直接将一只大象当做动物类别的一个物件即可。所以我们可以说在OOP 所说的物件(Object)就是我们现实世界的一个实体，就如同人类若是一个类别，那你就是隶属此类别的一个唯一独立的物件。
zh_tw: 雖然在自然上，一隻大象這個物件同時隸屬於大象類及動物類，但看目標的需要，也可以直接將一隻大象當做動物類別的一個物件即可。所以我們可以說在 OOP 所說的物件(Object)就是我們現實世界的一個實體，就如同人類若是一個類別，那你就是隸屬此類別的一個唯一獨立的物件。

source: Depend to the domain which we want to approach,or to define, we will define some different classes to describe the same objects. Like if we want to study a city bioecology system, we may define an animal class, that contain some people, some pets, and so on... But when our domain is to make a phone book application, we may define a person class that contain some people, but no pets, except our pets have a cell phone too.
fr: Dépendra le domaine qui nous voulons aborder, ou à définir, nous allons définir quelques classes différentes pour décrire les mêmes objets. Comme si nous voulons étudier un système de bio-écologie de la ville, on peut définir une classe d'animaux, qui contiennent certaines personnes, certains animaux, et ainsi de suite ... Mais quand notre domaine est de faire une demande de livre de téléphone, nous pouvons définir une classe de personne qui contiennent certaines personnes, mais pas d'animaux, à l'exception de nos animaux de compagnie ont un téléphone portable aussi.
ja: 我々は、範囲や必要性に基づいて設定され、我々は別のカテゴリをデザインし、それらが同時に同じオブジェクトに属してみましょうことができます。このような我々は都市の生態を勉強したいときなどは、頂きます、私たちは、動物のカテゴリなど何人かの人々、ペットを含むオブジェクトのこのカテゴリを設計するかもしれない...しかし、我々は、電話帳プログラムを作りたい人物カテゴリを設計、一部の人々は、このクラスのオブジェクトになりますが、彼らは携帯電話を持っていない限り、ペット、ペットが含まれていません。
zh_cn: 依据我们设定的范围与需要，我们可能设计出不同的类别，而让同一个物件同时隶属于它们。如我们想要研究城市生态时，我们可能会设计一个animal 类别，而这个类别中的物件包括一些人，一些宠物等等...但当我们想要制作一个电话簿程式时，那我们就会设计一个person 类别，一些人会成为此类别的物件，但不会包括宠物，除非这些宠物也都拥有手机。
zh_tw: 依據我們設定的範圍與需要，我們可能設計出不同的類別，而讓同一個物件同時隸屬於它們。如我們想要研究城市生態時，我們可能會設計一個 animal 類別，而這個類別中的物件包括一些人，一些寵物等等...但當我們想要製作一個電話簿程式時，那我們就會設計一個 person 類別，一些人會成為此類別的物件，但不會包括寵物，除非這些寵物也都擁有手機。

source: In this sudoku solving library, we define the following classes:
fr: Dans cette bibliothèque sudoku de résolution, nous définissons les classes suivantes:
ja: このプロジェクトでは、主なカテゴリがありますように設計。
zh_cn: 在这个专案中，我们设计的主要类别有:
zh_tw: 在這個專案中，我們設計的主要類別有:

source: Number Class:
fr: Nombre Classe:
ja: Numberクラス：

source: You can treat every number as a different man, there are 9 countries, and every country has 9 men. So we can treat the Number Class as a Country Class. Every country has their ID, here is 1-9, and every country would record the positions where their people live in this valley.
fr: Vous pouvez traiter chaque numéro comme un autre homme, il ya 9 pays, et chaque pays dispose de 9 hommes. Donc, nous pouvons traiter la classe en tant que numéro un de catégorie Pays. Chaque pays a son ID, voici 1-9, et chaque pays serait d'enregistrer les positions où leurs habitants vivent dans cette vallée.
ja: 私たちは、それぞれの番号が人である数独ゲームがかかる場合があります。全世界数独は、それぞれの国が9人を持って、9カ国があります。だから、ナンバークラスは、国家のカテゴリとみなすことができる。すべての国は、識別コード（ID）を持ってここに1-9で、それぞれの国が、この谷に住んでいるその人の位置を記録します。
zh_cn: 我们可以视数独游戏中每个数字是一个人。而整个数独世界中有9 个国家，每个国家有9 个人。如此，这个Number Class 就可以视为是一个国家类别。每一个国家都有一个识别代码(ID)，在这里是1-9，而每个国家都会纪录它的人民住在这山谷中的位置。
zh_tw: 我們可以視數獨遊戲中每個數字是一個人。而整個數獨世界中有 9 個國家，每個國家有 9 個人。如此，這個 Number Class 就可以視為是一個國家類別。每一個國家都有一個識別代碼(ID)，在這裡是 1-9，而每個國家都會紀錄它的人民住在這山谷中的位置。

source: Point Class:
fr: Point de Classe:
ja: Pointクラス：

source: Point is a house here. It indicate that there is empty or not, if it is not empty, which country people lives there? if it is empty, which counties' people can live here?
fr: Point est une maison ici. Il indique qu'il est vide ou pas, si elle n'est pas vide, quel pays les gens y vit? si elle est vide, les gens de qui comtés peuvent vivre ici?
ja: Pointオブジェクトは、家です。それが空である場合には、入学を申請するためにどの国の人々させることができ、それはあなたが生きていかなければならない場合、それはどの国の人であり、生きるために持っている場合、それぞれの家にマークされるのですか？
zh_cn: Point 物件就是一间房子。每间房子都会标注它是否已住人，如果已住人，那是哪个国家的人民；如果是空的，那可以让哪些国家的人民来申请入住？
zh_tw: Point 物件就是一間房子。 每間房子都會標註它是否已住人，如果已住人，那是哪個國家的人民；如果是空的，那可以讓哪些國家的人民來申請入住？

source: GroupBase Class:
fr: GroupBase Classe:
ja: GroupBaseクラス：

source: GroupBase is group of X line, Y line or a 3x3 Box. This is base class of Box, lineX, lineY. It indicate which houses are belong to him, how many people have lived in this group? and which counties' people still not live in this group?
fr: GroupBase est un groupe de ligne de X, Y ou ligne d'une zone de 3x3. C'est la classe de base de boîte, Linex, Liney. Il indique que les maisons appartiennent à lui, combien de personnes ont vécu dans ce groupe? et les personnes qui comtés toujours pas vivre dans ce groupe?
ja: GroupBaseはつまり、そのオブジェクトは実体ではないが、グループクラスですが、実体の組み合わせのグループ。ここGroupBase3グループ、住宅建設のブロック群とグループXおよびY軸方向が含まれています。各オブジェクトには、多くの人々が住んでいたか、それが含まれている家の指摘だけでなく、ここに住んでいない国々の人々のだろうか？
zh_cn: GroupBase是一种群组类别，也就是它的物件不是一个实体，而是一群实体的组合。在这里的GroupBase 包含了三种群组，X​​ 与Y 轴方向的房子群组及区块房子群组。每个物件都将指出它包含了哪些房子，已经住了多少人，还有哪些国家的人民还没住进来？
zh_tw: GroupBase是一種群組類別，也就是它的物件不是一個實體，而是一群實體的組合。在這裡的 GroupBase 包含了三種群組，X 與 Y 軸方向的房子群組及區塊房子群組。 每個物件都將指出它包含了哪些房子，已經住了多少人，還有哪些國家的人民還沒住進來？

source: Box Class:
fr: Box Classe:
ja: ボックスクラス：

source: Every 3x3 block. Every box has its id, from left to right, from top to down, it is assigned 1-9, as the following picture:
fr: Chaque bloc de 3x3. Chaque boîte a son Identifiant, de gauche à droite, de haut en bas, il est affecté 1-9, comme l'image suivante:
ja: これは、ブロックグループのためGroupBaseサブカテゴリです。 ：左から、次のようにマークされたコードのブロックである右、上から下へ、合計9ブロックオブジェクト内の数独の世界
zh_cn: 它是GroupBase的子类别，为区块群组。在数独世界中总共有9 个区块物件，从左到右，从上到下，被标注其区块代码如下:
zh_tw: 它是GroupBase的子類別，為區塊群組。在數獨世界中總共有 9 個區塊物件，從左到右，從上到下，被標註其區塊代碼如下:

source: lineX Class:
fr: LinEx Classe:
ja: LINEXクラス：

source: Every x-way line. Every x-way line has its id, from left to right, it is assigned 1-9, as the following picture:
fr: Chaque ligne X-Way. Chaque ligne X-Way a son Identifiant, de gauche à droite, il est affecté 1-9, comme l'image suivante:
ja: GroupBaseこのサブクラス、家のためのグループX軸。次のように左から右に数独の世界では9のオブジェクトの合計は、1〜9のラベルが付いています。
zh_cn: 这是GroupBase 子类别，为X 轴的房子群组。在数独世界中共有9 个物件，从左到右被标注1-9，如下图:
zh_tw: 這是 GroupBase 子類別，為 X 軸的房子群組。在數獨世界中共有 9 個物件，從左到右被標註 1-9，如下圖:

source: lineY Class:
fr: Liney Classe:
ja: 線を引いたクラス：

source: Every y-way line. Every y-way line has its id, from top to down, it is assigned 1-9, as the following picture:
fr: Chaque ligne y-chemin. Chaque ligne y-chemin a son Identifiant, de haut en bas, il est affecté 1-9, comme l'image suivante:
ja: GroupBaseこのサブクラス、家のためのグループのY軸。以下のように上から下に数独の世界では9のオブジェクトの合計は、1〜9ラベル付けされます。
zh_cn: 这是GroupBase 子类别，为Y 轴的房子群组。在数独世界中共有9 个物件，从上到下被标注1-9，如下图:
zh_tw: 這是 GroupBase 子類別，為 Y 軸的房子群組。在數獨世界中共有 9 個物件，從上到下被標註 1-9，如下圖:

source: Matrix Class:
ja: Matrixクラス：

source: Matrix Class is the WORLD of a sudoku game. It is the beautiful valley, including 9 countries, every country have 9 people, there are 9x9 houses for all these people.
fr: Matrix Class est le monde d'un jeu de sudoku. C'est la belle vallée, dont 9 pays, tous les pays ont 9 personnes, il ya des maisons 9x9 pour tous ces gens.
ja: Matrixクラスは、数独、全世界を定義しています。それはそれぞれの国が9人を持って、9カ国の人々を含む、美しい渓谷、ですが、谷の家は、英国を形成するために、いつまでも平和のうちに生存するこれらの人々に提供するために、9路盤を構築しました。
zh_cn: Matrix class定义了数独游戏的整个世界。它是一个美丽的山谷，包含了9 个国家的人民，每一个国家有9 个人，山谷中建造了9x9 间房子以提供给这些人民来居住，以组成一个永远和平的联合王国。
zh_tw: Matrix class定義了數獨遊戲的整個世界。它是一個美麗的山谷，包含了 9 個國家的人民，每一個國家有 9 個人，山谷中建造了 9x9 間房子以提供給這些人民來居住，以組成一個永遠和平的聯合王國。

source: What is a Property?
fr: Qu'est-ce qu'une propriété?
ja: プロパティ（プロパティ）とは？
zh_cn: 什么是属性(Property)？
zh_tw: 甚麼是屬性(Property)？

source: Property is in a class to declaim what it cotain and how they look like or their conditions. Like a person class, may have these properties of how much money he have, how many children he have, , and first child is boy or girl, how old are them?
fr: La propriété est dans une classe à déclamer ce qu'il COTAIN et comment ils ressemblent ou leurs conditions. Comme une classe de personne, peuvent avoir ces propriétés de combien d'argent il encore, combien d'enfants il encore, et premier enfant est garçon ou fille, quel âge ont-elles?
ja: プロパティ（プロパティ）、クラス、文字とレコードの状態のメンバーを定義するために使用し、内部の定義のクラス（クラス）である。次の属性のいくつかを含むことができ、人のカテゴリー場合：この男は、彼はいくつかの子供がいたどのくらいのお金を所有、最初の子は、男性または女性で、それぞれの子それぞれが古い？
zh_cn: 属性(Property)是在类别(Class)的定义里面，类别用它来定义成员，特征及纪录状况。如在一个人的类别里面可能会包含以下一些属性: 这人拥有多少钱、他有几个小孩子、第一个小孩是男或是女、每个小孩各是几岁?
zh_tw: 屬性(Property)是在類別(Class)的定義裡面，類別用它來定義成員，特徵及紀錄狀況。如在一個人的類別裡面可能會包含以下一些屬性: 這人擁有多少錢、他有幾個小孩子、第一個小孩是男或是女、每個小孩各是幾歲?

source: The following are the major properties of all classes in this libryary:
fr: Voici les principales propriétés de toutes les classes dans ce libryary:
ja: 以下はこのプロジェクトのいくつかの主要なカテゴリに定義されている主な属性です。
zh_cn: 以下是这个专案中几个主要类别的主要属性定义:
zh_tw: 以下是這個專案中幾個主要類別的主要屬性定義:

source: Number class:
fr: Nombre Classe:
ja: Numberクラス：

source: v: the id of a country, it is 1-9.
fr: v: l'identifiant d'un pays, il est 1-9.
ja: V：国コード、1-9
zh_cn: v: 这个国家的代码, 1-9
zh_tw: v: 這個國家的代碼, 1-9

source: p: the list of the houses which these country people have lived in
fr: p: la liste des maisons de ces gens de la campagne ont vécu dans
ja: P：人々が住んでいるこの国のすべての家をリスト
zh_cn: p: 这个国家每一个人民所居住的房子列表
zh_tw: p: 這個國家每一個人民所居住的房子列表

source: filled: how many people have lived in a house
fr: rempli: combien de personnes ont vécu dans une maison
ja: filled：どのように多くの人々は家に移動しました
zh_cn: filled: 有多少人已经住进房子了
zh_tw: filled: 有多少人已經住進房子了

source: Point class:
fr: Point de Classe:
ja: Pointクラス：

source: x: the x-way postion of this house
fr: x: x-chemin postion de cette maison
ja: X：家のx座標
zh_cn: x: 这个房子的 x 轴座标
zh_tw: x: 這個房子的 x 軸座標

source: y: the y-way position of this house
fr: y: la position y-chemin de cette maison
ja: Y：家のy座標
zh_cn: y: 这个房子的 y 轴座标
zh_tw: y: 這個房子的 y 軸座標

source: v: which country people has lived here, if it is still empty, its value is 0
fr: v: quel pays les gens ont vécu ici, si elle est vide, sa valeur est 0
ja: V：この家は、それが空である場合、その値は0であり、どの国の人が住んでいました
zh_cn: v: 这个房子居住了哪个国家的人民，如果是空的，那它的值就是 0
zh_tw: v: 這個房子居住了哪個國家的人民，如果是空的，那它的值就是 0

source: b: this house belogn which 3x3 box
fr: b: cette maison qui belogn boîte 3x3
ja: B：ブロックは添付の家
zh_cn: b: 这个房子隶属哪个区块
zh_tw: b: 這個房子隸屬哪個區塊

source: GroupBase class:
fr: GroupBase Classe:
ja: GroupBaseクラス：

source: idx: the id of this group
fr: idx: l'identifiant de ce groupe
ja: IDX：このコードグループ
zh_cn: idx: 这个群组的代码
zh_tw: idx: 這個群組的代碼

source: p: the list of the houses which belong this group
fr: p: la liste des maisons qui appartiennent à ce groupe
ja: P：このグループの家の会員名簿
zh_cn: p: 隶属这个群组的房子列表
zh_tw: p: 隸屬這個群組的房子列表

source: filled: how many people have lived in this group
fr: rempli: combien de personnes ont vécu dans ce groupe
ja: いっぱい：多くの人々のために生きてきたこのグループの
zh_cn: filled: 在这个群组里面已经居住了多少人
zh_tw: filled: 在這個群組裡面已經居住了多少人

source: possible: the list of country id which have not lived in this group
fr: possible: la liste des id de pays qui n'ont pas vécu dans ce groupe
ja: possilbe：このグループには住んでいなかった国々は、これらの国々のコードリストの値もある
zh_cn: possilbe: 在这个群组里面还有哪些国家还没住进来，值为这些国家的代码列表
zh_tw: possilbe: 在這個群組裡面還有哪些國家還沒住進來，值為這些國家的代碼列表

source: What is **effects**?
fr: Qu'est-ce que les effets ** **?
ja: 「**effects**」とは何ですか？
zh_cn: 什么是「**effects**」？
zh_tw: 什麼是「**effects**」？

source: Effects of a box are the 4 boxes which the same direction of x or y with it. So, effectsX are the boxes that have the same x-way direction, while effectsY are the boxes that have the same y-way direction of it.
fr: Effets d'une boîte sont les quatre cases dont le même sens de x ou y conformer. Donc, effectsX sont les boîtes qui ont la même direction x à sens unique, tandis que les boîtes sont effectsY qui ont la même direction y-chemin de celui-ci.
ja: 私たちは**影響のそのブロック（ボックス）を言うと、このブロックは、他の4ブロックの同じx軸とy軸の方向を持っていると言われています。たときしたがって、effectsX x軸方向が同一ブロックで、effectsY y軸方向が同じブロックである。
zh_cn: 当我们说一个区块(box)的**effects**，是说与这个区块有相同的x 与y 轴方向的其他四个区块。所以，effectsX就是有同样x 轴方向的区块，effectsY就是有同样y 轴方向的区块。
zh_tw: 當我們說一個區塊(box)的**effects**，是說與這個區塊有相同的 x 與 y 軸方向的其他四個區塊。所以，effectsX就是有同樣 x 軸方向的區塊，effectsY就是有同樣 y 軸方向的區塊。

source: Box class:
fr: Box Classe:
ja: ボックスクラス：

source: All GroupBase Properties
fr: Toutes les propriétés GroupBase
ja: すべての属性が含まれていGroupBase
zh_cn: 包含所有 GroupBase 的属性
zh_tw: 包含所有 GroupBase 的屬性

source: effects: the box id list of a box's neighbors
fr: effets: la zone de liste identifiant les voisins d'une boîte
ja: effects: すべてのネイバーは、このブロックをブロック
zh_cn: effects: 这个区块的所有邻居区块
zh_tw: effects: 這個區塊的所有鄰居區塊

source: effectsX: the box id list of a box's neighbors which in x-way direction
fr: effectsX: la zone de liste identifiant les voisins d'une boîte qui dans la direction X-Way
ja: effectsX：このブロックは、x軸の等方性の隣人
zh_cn: effectsX: 这个区块的 x 轴方相邻居
zh_tw: effectsX: 這個區塊的 x 軸方相鄰居

source: effectsY: the box id list of a box's neighbors which in Y-way direction
fr: effectsY: la zone de liste identifiant les voisins d'une boîte qui dans la direction Y-chemin
ja: effectsY：このブロックは、Y軸等方性の隣人
zh_cn: effectsY: 这个区块的 y 轴方相邻居
zh_tw: effectsY: 這個區塊的 y 軸方相鄰居

source: lineX class:
fr: LinEx Classe:
ja: LINEXクラス：

source: Having the same properties as GroupBase
fr: Ayant les mêmes propriétés que GroupBase
ja: GroupBaseは同じで属性
zh_cn: 与 GroupBase 的属性相同
zh_tw: 與 GroupBase 的屬性相同

source: lineY class:
fr: Liney Classe:
ja: 線を引いたクラス：

source: Matrix class:
ja: Matrixクラス：

source: p: A two dimention of point(house), from p[0][0] to p[8][8] to present all the houses in this valley.
fr: p: A deux dimention du point (maison), de p [0] [0] pour p [8] [8] de présenter toutes les maisons dans cette vallée.
ja: P：二次配列の家のリスト、Pから[0][0] P〜[8] [8]、この谷にすべての住宅に代わって。
zh_cn: p: 一个二阶阵列的房子列表，从p[0][0] 到p[8][8]，代表这个山谷的所有房子。
zh_tw: p: 一個二階陣列的房子列表，從 p[0][0] 到 p[8][8]，代表這個山谷的所有房子。

source: lineX: A list of x-way line of the houses
fr: LinEx: Une liste de ligne x-chemin des maisons
ja: LINEX：X軸方向の家グループのリスト
zh_cn: lineX: x 轴方向房子群组的列表
zh_tw: lineX: x 軸方向房子群組的列表

source: lineY: A list of y-way line of the houses
fr: Liney: Une liste de droite y-chemin des maisons
ja: 線を引いた：y軸は、グループの家をリストします
zh_cn: lineY: y 轴方向房子群组的列表
zh_tw: lineY: y 軸方向房子群組的列表

source: b: A list of 3x3 box of the houses
fr: b: Une liste de la boîte de 3x3 des maisons
ja: B：ブロックハウスグループリスト
zh_cn: b: 区块房子群组的列表
zh_tw: b: 區塊房子群組的列表

source: n: A list of Country.
fr: n: Une liste de pays.
ja: N：すべての国のリスト
zh_cn: n: 所有国家的列表
zh_tw: n: 所有國家的列表

source: filled: how many people have lived in a house now.
fr: remplis: combien de personnes ont vécu dans une maison maintenant.
ja: いっぱい：谷での滞在を持っているどのように多くの人々の記録を
zh_cn: filled: 纪录已经有多少人入住在这个山谷了
zh_tw: filled: 紀錄已經有多少人入住在這個山谷了

source: What is a Method?
fr: Qu'est-ce qu'une méthode?
ja: メソッド（方法）とは何ですか？
zh_cn: 什么是方法(Method)？
zh_tw: 甚麼是方法(Method)？

source: Methods are the behaviors of a class or an object. For example, if we define a radio class contain several buttons, then we should define the methods when some button has been pushed. It may start to receive a program from a station, or record a program into CD, etc...
fr: Les méthodes sont les comportements d'une classe ou d'un objet. Par exemple, si nous définissons une classe de la radio contient plusieurs boutons, alors nous devrions définir les méthodes lorsque certaines bouton a été poussé. Il peut commencer à recevoir un programme d'une station, ou enregistrer un programme dans le lecteur CD, etc ..
ja: 方法（メソッド）は、クラスとそのオブジェクトの特定の動作の一部です。例えば我々はラジオのカテゴリを定義した場合、それは、ボタンのプロパティの一部を含むことになる、と私たちはボタンを押したときに、我々は、このアクションを実行するためにいくつかのメソッドを定義する必要があります。これらのアクションは、というようにCDにラジオ番組、または録画された番組の受信を開始することであってもよく、...
zh_cn: 方法(methods)是一个类别及其物件的一些特定行为。举个例子，如果我们定义了一个收音机类别，它将包含一些按钮的属性，而当我们按下这些按钮时，我们就必须定义一些方法来执行这个动作。这些动作有可能是开始接收某个电台的节目、或者是录制节目到CD等等...
zh_tw: 方法(methods)是一個類別及其物件的一些特定行為。舉個例子，如果我們定義了一個收音機類別，它將包含一些按鈕的屬性，而當我們按下這些按鈕時，我們就必須定義一些方法來執行這個動作。這些動作有可能是開始接收某個電台的節目、或者是錄製節目到CD等等...

source: The following are the major methods of the classes in this library:
fr: Voici les principales méthodes des classes de cette bibliothèque:
ja: 以下は、プロジェクトのクラスパスで使用される主な方法です。
zh_cn: 以下是这个专案中的类别中使用道的主要方法:
zh_tw: 以下是這個專案中的類別中使用道的主要方法:

source: setit(p1): when a country's people find a house(p1) to live, this method will be called
fr: Setit (p1): quand le peuple d'un pays à trouver une maison (p1) à vivre, cette méthode sera appelée
ja: setit（P1）：誰かが自分の家を見つけたとき、彼らはこの方法を開始します
zh_cn: setit(p1): 当有人找到属于自己的房子时，就会启动这个方法
zh_tw: setit(p1): 當有人找到屬於自己的房子時，就會啟動這個方法

source: can_see(p1): to check a house can see another house(p1) or not?
fr: can_see (p1): pour vérifier une maison peut voir une autre maison (p1) ou pas?
ja: can_see（P1）：ハウス****は別の家（P1）を参照してくださいかどうかをテスト？
zh_cn: can_see(p1): 测试一个房子是否能够**看到**另外一个房子(p1)?
zh_tw: can_see(p1): 測試一個房子是否能夠**看到**另外一個房子(p1)?

source: can_see_those(posList): to check a house can see a list of houses, and return the houses list which it can see them.
fr: can_see_those (posList): pour vérifier une maison peut voir une liste de maisons, et retourner la liste des maisons qui ne peut les voir.
ja: can_see_those（POSLIST）：ハウス**** POSLISTは家がリストされたかどうかをテストし、すべての家のリストが返さを見ることができます。
zh_cn: can_see_those(posList): 测试一个房子能否**看见** posList 所列的房子，并将所有能看见的房子列表传回。
zh_tw: can_see_those(posList): 測試一個房子能否**看見** posList 所列的房子，並將所有能看見的房子列表傳回。

source: What is "**SEE**"?
fr: Qu'est-ce que "** VOIR **"?
ja: 「見る」とは何ですか？
zh_cn: 什么是「**看见**」？
zh_tw: 甚麼是「**看見**」？

source: the houses in the same x-way or y-way line, or in the same box, of a house, this means that this house can **SEE** all of them.
fr: les maisons dans le même sens x ou y-chemin ligne ou dans la même boîte, d'une maison, ce qui signifie que cette maison peut ** VOIR ** tous.
ja: その同じ行、同じ列、または1ブロック内の他の家との家、という点では、の家を見ることが可能である。
zh_cn: 对一个房子而言，与它同一排、同一列、或者同在一个区块的其他房子，都是它能够**看见**的房子。
zh_tw: 對一個房子而言，與它同一排、同一列、或者同在一個區塊的其他房子，都是它能夠**看見**的房子。

source: allow(v): check the group can allow the country people(whose id is v) to live or not?
fr: permettre (v): vérifier le groupe peut permettre aux gens de la campagne (dont l'id est v) de vivre ou pas?
ja: グループをテストするには生きるために家のラベルVの人々を行うことができます。（V）を許可しますか？
zh_cn: allow(v): 测试一个房子群组能否让标记为v 的国家人民来居住？
zh_tw: allow(v): 測試一個房子群組能否讓標記為 v 的國家人民來居住？
