Repository: RobertOfTaiwan/SudokuStudyLib
Catalog: docs/source/locale/*/LC_MESSAGES/data.po
Languages: fr, ja, zh_cn, zh_tw

source: get_num_pos(v): get where the people live in this group who is the country people(whose id is v), if there is no this country's people, it will return None.
fr: get_num_pos (v): arriver là où les gens vivent dans ce groupe qui est les gens du pays (dont l'id est v), s'il n'y a pas des gens de ce pays, il retourne None.
ja: get_num_pos（V）：この家グループでは、国がまだ占有されていない場合人々は、カントリーハウス生活オブジェクトをV作っなし応答を配置します。
zh_cn: get_num_pos(v): 在这个房子群组中，取得v 国人民居住的房子物件，如果该国尚未有人入住，则以None来回应。
zh_tw: get_num_pos(v): 在這個房子群組中，取得 v 國人民居住的房子物件，如果該國尚未有人入住，則以None來回應。

source: count_num_possible(count): get the countries' id and houses, which are empty now, and are possible to be assigned to a certain country people, and the houses are equal to the number(count)
fr: count_num_possible (chiffre): obtenir l'identifiant et maisons, qui sont maintenant vide, et sont peut être attribué à un peuple des pays des pays, et les maisons sont égales au nombre (chiffre)
ja: count_num_possible（カウント）：自社グループ内では、それは家が生活の数を数えると等しくなるように利用できるようにすべきであることを意味し、カウントが取得されたパラメータがある場合は、国番号と国の人々のリストは、家に住んで利用できるように。
zh_cn: count_num_possible(count): 在一个房子群组中，取得国家的id及可供该国人民居住的房子列表，如果有参数count，则表示要取得的可供居住的房子数要等于count 才取回。
zh_tw: count_num_possible(count): 在一個房子群組中，取得國家的id及可供該國人民居住的房子列表，如果有參數 count，則表示要取得的可供居住的房子數要等於 count 才取回。

source: All GroupBase methods
fr: Toutes les méthodes GroupBase
ja: すべてGroupBaseクラスメソッド
zh_cn: 所有 GroupBase 类别的方法
zh_tw: 所有 GroupBase 類別的方法

source: get_group_number(num): To Check the num in a box's would form a Group Number or not.
fr: get_group_number (num): Pour vérifier le nombre dans une boîte de formerait un numéro de groupe ou pas.
ja: get_group_number（NUM）：numは国家仮想****の形成をブロックすることができます家の中で国コードをテストする？
zh_cn: get_group_number(num): 测试这个国家代码num 在一个房子区块中能否形成一个**虚拟国民**？
zh_tw: get_group_number(num): 測試這個國家代碼 num 在一個房子區塊中能否形成一個 **虛擬國民**？

source: What is "**Group Number**"?
fr: Qu'est-ce que "** Nombre de groupe **"?
ja: 「仮想国民****」とは？
zh_cn: 什么是「**虚拟国民**」？
zh_tw: 甚麼是「**虛擬國民**」？

source: Group Number is in a box. Those houses in this box can and only can allow some country's people, and these houses in a same line(x-way line or y-way line), then we call these houses form a **Group Number**, We don't know which house is the country's people should live finally, but we know the other houses in this line will not allow the same country's people to live.
fr: Numéro du groupe se trouve dans une boîte. Ces maisons dans cette case peuvent et ne peuvent permettre aux gens de certains pays, et ces maisons dans un même ligne (ligne X-Way ou y de ligne de chemin), nous appellerons ces maisons forment un numéro de groupe ** **, Nous n 't savent quelle maison est les gens du pays devraient enfin vivre, mais nous savons que les autres maisons dans cette ligne ne seront pas permettre aux gens de la même pays à vivre.
ja: ナショナルは、仮想の家のブロックグループ内に存在する。家のブロックでは、まだ占有されておらず、国が同じ方向に家に住んでされる可能性があり、すべての場合には、（XまたはY軸のいずれか）、その後、我々は**仮想を形成するこれらの家を呼び出すことができます国立**。私は、このブロックでは、最終的にはに住んでいるでしょう、この国の人々は知らないが、我々は、仮想国民から知っている、家は人々がこの国に住んでいることはできませんのと同じ方向に、他の地域とのけれどもA。
zh_cn: 虚拟国民存在于一个房子区块群组中。在一个区块中尚未有人入住的房子中，如果所有可能让某个国家居住的房子在同一个方向时(无论是x 轴或y 轴)，那我们就可以称这些房子形成了一个**虚拟国民**。虽然我还不晓得在这个区块中，这个国家的人民最后将居住在哪里，但我们从虚拟国民中知道，在与它同个方向的其他区域的房子，都将不允许居住这个国家的人民了。
zh_tw: 虛擬國民存在於一個房子區塊群組中。在一個區塊中尚未有人入住的房子中，如果所有可能讓某個國家居住的房子在同一個方向時(無論是 x 軸或 y 軸)，那我們就可以稱這些房子形成了一個**虛擬國民**。雖然我還不曉得在這個區塊中，這個國家的人民最後將居住在哪裡，但我們從虛擬國民中知道，在與它同個方向的其他區域的房子，都將不允許居住這個國家的人民了。

source: Having the same methods as GroupBase
fr: Avoir les mêmes méthodes que GroupBase
ja: GroupBase同じ方法
zh_cn: 与 GroupBase 有相同的方法
zh_tw: 與 GroupBase 有相同的方法

source: get_all_pos(method): if method="a", get all houses; if method="u", get all empty houses; if method="s", get all houses where have lived people
fr: get_all_pos (méthode): si la méthode = "a", obtenir toutes les maisons; si la méthode = "u", obtenir toutes les maisons vides; si la méthode = "s", obtenir toutes les maisons où ont vécu les gens
ja: get_all_pos(method)： method="a"、すべての住宅を取得する場合は、リストオブジェクト、method="u" 使用可能なすべてのリストを取得する場合は、method="s"、すべての生きて人間を取得する場合家のリスト。
zh_cn: get_all_pos(method): 如果method = "a"， 取得所有房屋物件列表；如果method="u"，则取得所有空房列表；如果method="s"，则取得所有已住人的房子列表。
zh_tw: get_all_pos(method): 如果 method = "a"， 取得所有房屋物件列表；如果 method="u"，則取得所有空房列表；如果 method="s"，則取得所有已住人的房子列表。

source: sort_unassigned_pos_by_possibles(possibles): get all empty houses which are only allowfd for [possibles] countries people, if possibles == 0, it will get all empty houses, and sorted by the possiles from low to high.
fr: sort_unassigned_pos_by_possibles (possibles): obtenir toutes les maisons vides qui ne sont allowfd pour [possibles] pays, les personnes, si possibles == 0, il obtiendra toutes les maisons vides, et triés par les possiles de faible à élevé.
ja: sort_unassigned_pos_by_possibles（possibles）：可用性のすべてのリストを取得し、これらを利用できるようにすることができなければならないだけpossibles== 0は、使用可能なすべてを取得する場合は、滞在するいくつかの国をpossibles。多くの国々が居住されるときに戻って応答、小型、大規模排出される。
zh_cn: sort_unassigned_pos_by_possibles(possibles): 取得所有的空房列表，而这些空房数必须仅能够让possibles 个国家的人入住，如果possibles == 0, 将取得全部空房。回应回来时将以可居住国家数，从小排到大。
zh_tw: sort_unassigned_pos_by_possibles(possibles): 取得所有的空房列表，而這些空房數必須僅能夠讓 possibles 個國家的人入住，如果 possibles == 0, 將取得全部空房。回應回來時將以可居住國家數 ，從小排到大。

source: can_see(p0, method="u", num=0): get the houses which cand the house(p0), if the num!=0, mean get the houses only that are allowed the num country's people.
fr: can_see (p0, method = "u", num = 0): obtenir les maisons qui cand la maison (p0), si le num = 0, veut obtenir les maisons seulement sont autorisés les gens du pays num.
ja: can_see(p0, method="u", num=0): このような=0ナショナル·テンキーなどのハウス（P0）家のリストを見ることができ得る、唯一の家に住んでいる民のための国別コードを可能にするために利用できるようにことを示しています！。
zh_cn: can_see(p0, method="u", num=0): 取得能够看见某一房子(p0)的房子列表，如国num!=0，表示仅取得可让国家代码为num 者居住的房子。
zh_tw: can_see(p0, method="u", num=0): 取得能夠看見某一房子(p0)的房子列表，如國 num!=0，表示僅取得可讓國家代碼為 num 者居住的房子。

source: setit(x, y, v): Let the v country's people live in the the house of the position (x, y).
fr: Setit (x, y, v): Laissez les gens du pays de v vivent dans la maison de la position (x, y).
ja: setit（X、Y、V）：ある家の安全な座標（x、y）に住んでいる人々のためのV国コードをしてみましょう。
zh_cn: setit(x, y, v): 让国家代码为v 的人民安住在座标为(x, y)的房子。
zh_tw: setit(x, y, v): 讓國家代碼為 v 的人民安住在座標為(x, y)的房子。

source: reduce(x, y, v): When a country people find a suitable house to live, then any empty house can SEE the house will reduce their possible countries people to live in.
fr: réduire (x, y, v): Quand un peuple du pays à trouver une maison convenable pour vivre, alors une maison vide peut voir la maison permettra de réduire leurs pays possibles gens à vivre po
ja: （X、Y、V）を減少させる：ハウス（x、y）は、他の利用可能性をチェックするときは、この家を見ることができ、すでにこの国では（V）の可能性を生きる人々を失うため、このように利用できます。
zh_cn: reduce(x, y, v): 当一个房子(x, y)被入住时，任何能够看见此房子的其他空房，都可用此方法来减掉已入住这个国家人民(v)的可能性。
zh_tw: reduce(x, y, v): 當一個房子(x, y)被入住時，任何能夠看見此房子的其他空房，都可用此方法來減掉已入住這個國家人民(v)的可能性。

source: allow(x, y, v): check the v country people can live in the house of the position (x, y) or not?
fr: permettre (x, y, v): consultez le pays v gens peuvent vivre dans la maison de la position (x, y) ou pas?
ja: 許可（X、Y、V）：テストこの国（V）の人々は座標（x、y）の家に住むことができるかどうか？
zh_cn: allow(x, y, v): 测试这个国家(v)的人民是否能够居住于座标(x, y)的房子？
zh_tw: allow(x, y, v): 測試這個國家(v)的人民是否能夠居住於座標(x, y)的房子？

source: read(file): read the first defined that how many people and where they have lived in this valley.
fr: lire (dossier): lire le premier défini que le nombre de personnes et où ils ont vécu dans cette vallée.
ja: （ファイル）をお読みください。定義ファイル（ファイル）からこの谷、人や居住の場所に最初の国を読み込みます。
zh_cn: read(file): 从一个定义档(file)中读入最初到此山谷的国家、人民与居住位置。
zh_tw: read(file): 從一個定義檔(file)中讀入最初到此山谷的國家、人民與居住位置。

source: Game Defined File
fr: Jeu fichier défini
ja: 数独定義ファイル
zh_cn: 数独游戏定义档案
zh_tw: 數獨遊戲定義檔案

source: You can define sudoku's game by giving x, y, v line by line in a text file. like the following: its define file is in the [installed directory]/sudoku/data/
fr: Vous pouvez définir le jeu de sudoku en donnant x, y, v ligne par ligne dans un fichier texte. comme suit: définir son fichier est dans le [répertoire d'installation] / sudoku / données /
ja: あなたは、数独の初期条件を定義することができます。テキストファイルの行に、以下に示すように、フォームXで、Y、V、、このプロジェクトは、[インストールディレクトリ]/独/ data /ディレクトリに置き、数独の数と定義されている、家の座標と乗員を定義内側。
zh_cn: 你能够定义数独游戏的最初状况。在文字档中一行定义一个房子的座标及居住者，格式为x, y, v，如下图，此专案附有一些已定义好的数独，置于[安装的目录]/sudoku/data/ 目录里。
zh_tw: 你能夠定義數獨遊戲的最初狀況。在文字檔中一行定義一個房子的座標及居住者，格式為x, y, v，如下圖，此專案附有一些已定義好的數獨，置於 [安裝的目錄]/sudoku/data/ 目錄裡。

source: A sample define and its original and result matrix
fr: Un échantillon de définir et de sa matrice originale et le résultat
ja: 例の定義は、初期の外観や外溶液の外観
zh_cn: 一个定义范例、最初的外观以及解出来的外观
zh_tw: 一個定義範例、最初的外觀以及解出來的外觀

source: Original Matrix
fr: Matrice d'origine
ja: 数独の外観を開始
zh_cn: 起始的数独外观
zh_tw: 起始的數獨外觀

source: Result Matrix
fr: résultat Matrice
ja: 数独は、溶液の外観でした
zh_cn: 已解的数独外观
zh_tw: 已解的數獨外觀

source: get_all_pos(method): get all houses in this group, if method="a"; if method="u", get all empty houses, if method="s", get all not empty houses.
fr: get_all_pos (méthode): obtenir toutes les maisons de ce groupe, si la méthode = "a "; si la méthode = " u", obtenir toutes les maisons vides, si la méthode = "s ", obtenir maisons pas tous vides.
zh_cn: get_all_pos(method): 如果method = "a"， 取得一个房子群组的所有房屋物件列表；如果method="u"，则取得所有空房列表；如果method="s"，则取得所有已住人的房​​子列表。
zh_tw: get_all_pos(method): 如果 method = "a"， 取得一個房子群組的所有房屋物件列表；如果 method="u"，則取得所有空房列表；如果 method="s"，則取得所有已住人的房子列表。
