Repository: RobertOfTaiwan/SudokuStudyLib
Catalog: docs/source/locale/*/LC_MESSAGES/logic.po
Languages: fr, ja, zh_cn, zh_tw

source: What is logic?
fr: Quelle est la logique?
ja: 「論理」とは何ですか？
zh_cn: 「逻辑」是什么?
zh_tw: 「邏輯」是甚麼?

source: Logic is the most important for a person starting to discover the world
fr: Logic est le plus important pour une personne de commencer à découvrir le monde
ja: 学生の世界を探検するために学習を開始するために、ロジックは、最も重要なツールです。ジックは、最も重要なツールです。
zh_cn: 对一个开始学习去探索这个世界的学子而言，逻辑是最重要的工具之一。
zh_tw: 對一個開始學習去探索這個世界的學子而言，邏輯是最重要的工具之一。

source: The basic logic is dichotomy, is True or False in human language, or is 0 or 1 in computer language. It is the smallest and simplest classification which human can recognize and communicate with each other. So learning logic for children and young men is very important, because this is the base of all knowledge, and the base of all religion.
fr: La logique de base est dichotomie, est vrai ou faux dans le langage humain, ou est 0 ou 1 en langage informatique. Il s'agit de la classification la plus petite et la plus simple qui humain peut reconnaître et de communiquer les uns avec les autres. Donc logique pour les enfants et les jeunes hommes apprentissage est très important, car c'est la base de toute connaissance, et la base de toute religion.
ja: 最も基本的な論理が"yes"と "no"、または内部のコンピュータサイエンス「0」である二分法、「1」である。これは人間の認知の最小分類上の他の人とのコミュニケーションです。それはすべての知識の基盤は、すべての宗教の基礎であるであるため、そのように学習する児童生徒の論理は非常に重要です。るであるため、そのように学習する児童生徒の論理は非常に重要です。
zh_cn: 最基础的逻辑就是二分法，也就是「是」与「非」，或者在电脑科学里面的「0」与「1」。这是人类在认知上、与他人沟通上的最小分类方法。所以学习逻辑对中小学生而言是非常重要的，因为这是所有知识的基础，也是所有信仰的基础。
zh_tw: 最基礎的邏輯就是二分法，也就是「是」與「非」，或者在電腦科學裡面的「0」與「1」。這是人類在認知上、與他人溝通上的最小分類方法。所以學習邏輯對中小學生而言是非常重要的，因為這是所有知識的基礎，也是所有信仰的基礎。

source: **If you can't judge a thing is right or not, is existed or not, in one certain view point, you don't know the world, as you don't know yourself either.**
fr: ** Si vous ne pouvez pas juger une chose est juste ou non, est existé ou non, dans un certain point de vue, vous ne connaissez pas le monde, que vous ne vous connaissez pas non plus. **
ja: *ビューの特定のポイントに応じて、特定の時間に、あなたは事を判断できない場合は、「はい」または「いいえ」、または「存在」または、あなたはこの世界を理解していない、「存在しない」があるあなたは自分自身を知らない。 ** **
zh_cn: **如果依某一特定的角度、在某一特定时候，你无法判断某个事物是「是」或「非」、或者「存在」或「不存在」，那你就是不了解这个世界，同时你也不了解你自己。 **
zh_tw: **如果依某一特定的角度、在某一特定時候，你無法判斷某個事物是「是」或「非」、或者「存在」或「不存在」，那你就是不了解這個世界，同時你也不了解你自己。**

source: Learning Logic by Solving Sudoku
fr: Apprendre Logic par Solving Sudoku
ja: 数独のロジックから学ぶこと
zh_cn: 从解数独来学习逻辑
zh_tw: 從解數獨來學習邏輯

source: Learning logic can be a very happy thing if we teach it as a game, and Sudoku is the one. There are several good reasons to study logic by Solving sudoku:
fr: Logique d'apprentissage peut être une chose très heureux si nous enseignons comme un jeu, et de Sudoku est une. Il ya plusieurs bonnes raisons d'étudier la logique de résolution de sudoku:
ja: 我々は数独は非常に楽しいゲームですが、その後、ゲームから学ぶために行くことができれば、学習ロジックが、面白いことに変換することができます。私たちは、数独ロジックに学習に多くの利点を挙げることができる。独ロジックに学習に多くの利点を挙げることができる。
zh_cn: 学习逻辑可以变成一件有趣的事情，如果我们能够从游戏中去学习的话，而数独就是一种很好玩的游戏。我们可以列举很多以数独来学习逻辑的优点:
zh_tw: 學習邏輯可以變成一件有趣的事情，如果我們能夠從遊戲中去學習的話，而數獨就是一種很好玩的遊戲。我們可以列舉很多以數獨來學習邏輯的優點:

source: Its rules are so simple, everybody can know it in 5 minutes,
fr: Ses règles sont si simples, tout le monde peut savoir en 5 minutes,
ja: そのルールはかなり単純であり、誰でも5分以内にそれを理解することができます。そのルールはかなり単純であり、誰でも5分以内にそれを理解することができます。
zh_cn: 它的规则相当简单, 任何一个人能够在5分钟内了解它。
zh_tw: 它的規則相當簡單, 任何一個人能夠在5分鐘內了解它。

source: It is so complicated that have more than billions of combinations.
fr: Il est si compliqué qui ont plus de milliards de combinaisons.
ja: それはまた、組み合わせの数十億まで持つことができ、十分に複雑。それはまた、組み合わせの数十億まで持つことができ、十分に複雑。
zh_cn: 它又够复杂，它可以有多达数十亿种的组合。
zh_tw: 它又夠複雜，它可以有多達數十億種的組合。

source: It can be separated into different difficult levels easily.
fr: Il peut être séparé en différents niveaux de difficulté facile.
ja: それは人々の異なるレベルを使用することができる可能にするために、難易度の異なる種々であり得る。にするために、難易度の異なる種々であり得る。
zh_cn: 它可以分各种不同的困难程度，来让不同程度的人都能使用。
zh_tw: 它可以分各種不同的困難程度，來讓不同程度的人都能使用。

source: Learning Logic by Learning Python Programming
fr: Apprendre Logic par programmation Learning Python
ja: Pythonプログラミングロジックを学ぶことを学ぶ
zh_cn: 以学习 Python 程式设计来学习逻辑
zh_tw: 以學習 Python 程式設計來學習邏輯

source: Learning a computer language is the nature way to learn logic. Python is a interpreter script language, you can get every resource from https://www.python.org/. I recite a period of Python FAQ<https://docs.python.org/3/faq/general.html> about for the beginning programmers:
fr: Apprendre une langue de l'ordinateur est la façon naturelle d'apprendre logique. Python est un langage de script interprète, vous pouvez obtenir toutes les ressources de https://www.python.org/. Je récite une période de Python FAQ sur les programmeurs débutants:
ja: コンピュータ言語を学ぶことは、ロジックを学ぶのに非常に直感的な方法です。 Pythonは、プログラムの設計を実装するための簡単な方法を提供し、解釈コンピュータ言語です。 https://www.python.org/：ここでは、すべてのリソースの言語の公式ウェブサイトにコンピュータを得ることができます。私たちのFAQから Pythonは初心者のための適切なプログラミング理由を理解するためにいくつかのクリップ：由を理解するためにいくつかのクリップ：
zh_cn: 学习一种电脑语言是一种很直觉的方法来学习逻辑。 Python 是一种直译式电脑语言，提供一种简便的方式来实作程式的设计。你可以在下面官方网站来取得该电脑语言的所有资源: https://www.python.org/。我们从其 FAQ中剪輯一段來說明為何Python 適合程式設計的初學者:
zh_tw: 學習一種電腦語言是一種很直覺的方法來學習邏輯。Python 是一種直譯式電腦語言，提供一種簡便的方式來實作程式的設計。你可以在下面官方網站來取得該電腦語言的所有資源: https://www.python.org/。我們從其 FAQ<https://docs.python.org/3/faq/general.html> 中剪輯一段來說明為何 Python 適合程式設計的初學者:

source: Q:
ja: 問題：
zh_cn: 问题:
zh_tw: 問題:

source: Is Python a good language for beginning programmers?
fr: Python est un excellent langage pour programmeurs débutants?
ja: 初心者のために設計されたプログラムでは、Pythonは良い選択です？選択です？
zh_cn: 对一个程式设计初学者而言，Python是否是一个好选择？
zh_tw: 對一個程式設計初學者而言，Python是否是一個好選擇？

source: A:
ja: 回答：
zh_cn: 解答:
zh_tw: 解答:

source: Yes.
fr: Oui.
ja: はい。
zh_cn: 是的。
zh_tw: 是的。

source: It is still common to start students with a procedural and statically typed language such as Pascal, C, or a subset of C++ or Java. Students may be better served by learning Python as their first language. Python has a very simple and consistent syntax and a large standard library and, most importantly, using Python in a beginning programming course lets students concentrate on important programming skills such as problem decomposition and data type design. With Python, students can be quickly introduced to basic concepts such as loops and procedures. They can probably even work with user-defined objects in their very first course.
fr: Il est encore fréquent de commencer étudiants avec un langage procédural, et statiquement typé tels que Pascal, C, ou un sous-ensemble de C + + ou Java. Les élèves peuvent être mieux servis par l'apprentissage de Python comme première langue. Python a une syntaxe très simple et cohérente et une grande bibliothèque standard et, surtout, l'utilisation de Python dans un début sûr de programmation permet aux étudiants de se concentrer sur les compétences de programmation importants tels que la décomposition de problème et la conception de type de données. Avec Python, les étudiants peuvent être rapidement introduites dans les concepts de base tels que les boucles et les procédures. Ils peuvent peut-être même travailler avec des objets définis par l'utilisateur dans leur premier cours.
ja: 今、学生がプログラムを学ぶために始めたとき、またはこのようなC + +のパスカル、C、などの従来のコンピュータ言語を使用している。しかし、それは少し古風であり、学生は自分の探査プログラムを開始するためのより良いと簡単な方法に値する、とPythonはこれらの機能を提供します。これは非常に単純で一貫性のある文法構造を有しており、標準ライブラリは、多数の、最も重要なのは、それがかなりコンピュータサイエンスの詳細にも、課題を解決するために、学生がプログラミング技術に集中することを可能にすることである。 Pythonを使って、生徒たちはすぐにこのようなループ（ループ）、手順（プロシージャ）としてセットアッププログラムの基礎を学ぶことができます。でも、最初のクラスでは、彼らはカスタムオブジェクトを使用しようとさせることができます。ラスでは、彼らはカスタムオブジェクトを使用しようとさせることができます。
zh_cn: 现在学生开始学习程式时，还是在使用传统的电脑语言，如Pascal, C, C++。但这是有点古板了，学生应该得到更好与更简单的方法来开始他们的程式探索，而Python 就提供了这些特点。它拥有非常简单及一致的文法结构，以及大量的标准程式库，最重要的是，它让学生能够将心思放在解决问题的程式设计技巧上，而不是在电脑科学的细节上。使用Python，学生可以很快地学习程式设的基本知识，如回圈(loops)、程序(procedures)。甚至在第一堂课，就可以让他们尝试使用自订的物件。
zh_tw: 現在學生開始學習程式時，還是在使用傳統的電腦語言，如 Pascal, C, C++。但這是有點古板了，學生應該得到更好與更簡單的方法來開始他們的程式探索，而 Python 就提供了這些特點。它擁有非常簡單及一致的文法結構，以及大量的標準程式庫，最重要的是，它讓學生能夠將心思放在解決問題的程式設計技巧上，而不是在電腦科學的細節上。使用 Python，學生可以很快地學習程式設的基本知識，如回圈(loops)、程序(procedures)。甚至在第一堂課，就可以讓他們嘗試使用自訂的物件。

source: For a student who has never programmed before, using a statically typed language seems unnatural. It presents additional complexity that the student must master and slows the pace of the course. The students are trying to learn to think like a computer, decompose problems, design consistent interfaces, and encapsulate data. While learning to use a statically typed language is important in the long term, it is not necessarily the best topic to address in the students' first programming course.
fr: Pour un étudiant qui n'a jamais programmé, utilisant un langage typé statiquement semble naturelle. Il présente une complexité supplémentaire que l'élève doit maîtriser et ralentit le rythme du cours. Les élèves essaient d'apprendre à penser comme un ordinateur, décomposer les problèmes, de concevoir des interfaces cohérentes, et encapsuler des données. Tout en apprenant à utiliser un langage typé statiquement est important dans le long terme, ce n'est pas nécessairement le meilleur sujet à aborder dans premier cours de programmation des élèves.
ja: プログラミングの経験は、コンピュータが（など、C、のような）静的な言語を使用し、当初決して不自然なようである。これは、コース全体が遅くなるように、学生はまず、コンピュータの複雑な内部構造を理解しなければならないことができます。学生は、問題やデザインインターフェイスを解決するため、考えて見ると、コンピュータのポイントを使用する方法を学ぶ必要があります。長期目標ながら、静的コンピュータの研究が必要と利益であるが、まず第一に、しきい値をプログラムされる必要がそれほど高く混同しない。であるが、まず第一に、しきい値をプログラムされる必要がそれほど高く混同しない。
zh_cn: 一个从来没有程式设计经验者，一开始就使用静态式电脑语言(如C等)似乎是不自然的。它让学生必须先去了解电脑复杂的内部结构，使整个课程缓慢下来。学生必须学习如何使用电脑的角度来思考、解决问题及设计界面。虽然就长期目标而言，学习静态式电脑有其必要性与利益性，但对初学者而言，大可不必将程式设计的门槛弄得那么高。
zh_tw: 一個從來沒有程式設計經驗者，一開始就使用靜態式電腦語言(如C等)似乎是不自然的。它讓學生必須先去了解電腦複雜的內部結構，使整個課程緩慢下來。 學生必須學習如何使用電腦的角度來思考、解決問題及設計界面。雖然就長期目標而言，學習靜態式電腦有其必要性與利益性，但對初學者而言，大可不必將程式設計的門檻弄得那麼高。

source: Many other aspects of Python make it a good first language. Like Java, Python has a large standard library so that students can be assigned programming projects very early in the course that do something. Assignments aren't restricted to the standard four-function calculator and check balancing programs. By using the standard library, students can gain the satisfaction of working on realistic applications as they learn the fundamentals of programming. Using the standard library also teaches students about code reuse. Third-party modules such as PyGame are also helpful in extending the students' reach.
fr: Beaucoup d'autres aspects de Python font un bon langue maternelle. Comme Java, Python a une grande bibliothèque standard, de sorte que les étudiants peuvent être affectés projets de programmation très tôt dans le cours que faire quelque chose. Missions ne se limitent pas à la calculatrice à quatre fonctions standard et vérifier les programmes d'équilibrage. En utilisant la bibliothèque standard, les étudiants peuvent acquérir la satisfaction de travailler sur des applications réalistes comme ils apprennent les bases de la programmation. Utilisation de la bibliothèque standard enseigne également les élèves sur la réutilisation du code. Modules tiers tels que PyGame sont également utiles pour étendre la portée des élèves.
ja: Pythonはプログラミングを学ぶための好ましいコンピュータ言語として多くの利点があります。 Javaのような、それは教室での最大の学生がプロジェクトのいくつかを実装することができ、標準的なライブラリをたくさん持っているし、これらのプロジェクトではなく、単純な加算と減算、乗算、除算4演算よりも、いくつかの実用的なアプリケーションとすることができる。一方、これらの標準ライブラリを使用すると、学生がプログラムを学び、再利用することができます。他のサードパーティモジュールの種々はまた、pygameのような、非常に使いやすく、直接学生を可能にするために使用することができる。うな、非常に使いやすく、直接学生を可能にするために使用することができる。
zh_cn: Python拥有很多优点来当作学习程式设计的首选电脑语言。就如同Java，它拥有大量的标准程式库，可以让学生在课堂上去实作一些专案，而这些专案都可以是一些实用的应用程式，而不是简单的加减乘除四则运算。同时，使用这些标准程式库可以让学生学习程式的再利用。其他丰富的第三方模组也非常好用，如PyGame，都可以直接拿来让学生使用。
zh_tw: Python擁有很多優點來當作學習程式設計的首選電腦語言。就如同 Java，它擁有大量的標準程式庫，可以讓學生在課堂上去實作一些專案，而這些專案都可以是一些實用的應用程式，而不是簡單的加減乘除四則運算。同時，使用這些標準程式庫可以讓學生學習程式的再利用。其他豐富的第三方模組也非常好用，如 PyGame，都可以直接拿來讓學生使用。

source: Python's interactive interpreter enables students to test language features while they're programming. They can keep a window with the interpreter running while they enter their program's source in another window.
fr: Interpréteur interactif Python permet aux étudiants de tester les fonctionnalités de langue pendant qu'ils programmation. Ils peuvent garder une fenêtre avec l'interprète fonctionnement alors qu'ils entrent dans la source de leur programme dans une autre fenêtre.
ja: Pythonは、学生がテストの側縁に直接プログラムを記述することを可能にする対話型のインタプリタです。それはあなたのサイドウィンドウにコードを記述することができ、別のウィンドウで、コードを実行してテストします。き、別のウィンドウで、コードを実行してテストします。
zh_cn: Python是一个互动式的直译器，可以让学生直接边撰写程式边测试。它可以让你在一个视窗边写程式，而在另外一个视窗执行与测试这些程式码。
zh_tw: Python是一個互動式的直譯器，可以讓學生直接邊撰寫程式邊測試。它可以讓你在一個視窗邊寫程式，而在另外一個視窗執行與測試這些程式碼。

source: Features of this Library
fr: Les caractéristiques de cette bibliothèque
ja: このライブラリの特徴
zh_cn: 这个程式库的特点
zh_tw: 這個程式庫的特點

source: There are so many sudoku's puzzle games and studying in the world. Some are made for fun, some are for the studying of mathematics, while this library focus on logic learning. And the logic mainly is in human view, not in computer science view. So, there are some features in this package:
fr: Il ya des jeux de puzzle de tant de sudoku et d'étudier dans le monde. Certains sont faits pour le plaisir, certains sont pour l'étude des mathématiques, alors que cette bibliothèque accent sur l'apprentissage de la logique. Et la logique est principalement en vue humain, pas dans l'ordinateur vue de la science. Donc, il ya certaines caractéristiques dans ce dossier:
ja: この世界はあまりにも多くの数独ゲームや学習プログラム、娯楽のためのいくつかの、数学の研究のためのいくつかを持っており、このプロジェクトは、論理の研究に焦点を当てています。また、ここではロジックではなく、コンピュータサイエンスの観点よりも、出発点として見ると、人々の視点に捧げられています。そこで、本プロジェクトでは、次の特徴があります。そこで、本プロジェクトでは、次の特徴があります。
zh_cn: 这世上已经有太多的数独游戏或者学习程式，有些是为了娱乐，有些是为了数学的研究，而此专案则是专注在逻辑的学习上。而且，这里的逻辑是专门以人的角度为出发点，而不是电脑科学的角度。所以这个专案有以下特点:
zh_tw: 這世上已經有太多的數獨遊戲或者學習程式，有些是為了娛樂，有些是為了數學的研究，而此專案則是專注在邏輯的學習上。而且，這裡的邏輯是專門以人的角度為出發點，而不是電腦科學的角度。所以這個專案有以下特點:

source: This is mainly for studying logic for human.
fr: Ceci est principalement pour l'étude de la logique pour l'homme.
ja: 人々が「論理」の基本精神を学びましょう。
zh_cn: 让人们学习「逻辑」 的基本精神。
zh_tw: 讓人們學習「邏輯」 的基本精神。

source: It is NOT to plan to be a normal programming courses.
fr: Il n'est pas à prévoir d'être un cours de programmation normales.
ja: これは、一般的なプログラミングのコースであること」ではありません」。これは、一般的なプログラミングのコースであること」ではありません」。
zh_cn: 它「不是」要成为一般性的程式设计课程。
zh_tw: 它「不是」要成為一般性的程式設計課程。

source: It is NOT to plan to be a studying of serious mathematics.
fr: Il n'est pas de planifier à une étude des mathématiques graves.
ja: これは、厳密な数学的な研究であること」ではありません」。これは、厳密な数学的な研究であること」ではありません」。
zh_cn: 它「不是」要成为严谨的数学研究。
zh_tw: 它「不是」要成為嚴謹的數學研究。

source: The methods of solving a sudoku are mainly in a human view, NOT in computer science view.
fr: Les méthodes de résolution d'un sudoku sont principalement en vue humain, pas dans l'ordinateur vue de la science.
ja: 数独法は「非」コンピュータサイエンスの視点が、人間の視点を探索に基づいています。数独法は「非」コンピュータサイエンスの視点が、人間の視点を探索に基づいています。
zh_cn: 探索解数独的方法是以人的角度，而「非」电脑科学角度。
zh_tw: 探索解數獨的方法是以人的角度，而「非」電腦科學角度。

source: Let people to find their own methods to solve a sudoku, and name these methods in their own way. (This is not in this package, but should be arranged this in the courses.)
fr: Laissez les gens à trouver leurs propres méthodes pour résoudre un sudoku, et nommer ces méthodes dans leur propre chemin. (Ce n'est pas dans ce package, mais devrait être organisé ce dans les cours.)
ja: ストップは、人々が独自の方法を発見するために取得し、自分の言葉でそれに名前を付ける。 （これは内部でこのPythonのパッケージではありませんが、内部のこのコースで配置する必要がありますが。）ースで配置する必要がありますが。）
zh_cn: 让人们自己去发现解数独的方法，并且以自己的文字来命名它。 ( 这虽然不在此Python Package 里面，但必须将此安排在课程里面。)
zh_tw: 讓人們自己去發現解數獨的方法，並且以自己的文字來命名它。( 這雖然不在此 Python Package 裡面，但必須將此安排在課程裡面。)

source: Let people learning python to implement their own methods.
fr: Laissez les gens apprendre python pour mettre en œuvre leurs propres méthodes.
ja: 人々は、学生が自分の道を探るときに実行するために、Pythonプログラミングを学習することができます。Pythonプログラミングを学習することができます。
zh_cn: 让人们能够学习Python 程式设计以时做学生们自己探索出来的方法。
zh_tw: 讓人們能夠學習 Python 程式設計以時做學生們自己探索出來的方法。

source: Studying OOP programming to solve a sudoku. OOP method can be treated as human behavior.
fr: Étudier la programmation orientée objet pour résoudre un sudoku. Méthode de la programmation orientée objet peut être considéré comme le comportement humain.
ja: 数独を解決するために、オブジェクト指向プログラミング（OOP）を学習する。 OOPのアプローチは、人間の思考や行動の角度を一致させることができます。 OOPのアプローチは、人間の思考や行動の角度を一致させることができます。
zh_cn: 学习以物件导向程式设计(OOP)来求解数独。 OOP方法可以比拟为人的思考与行为角度。
zh_tw: 學習以物件導向程式設計(OOP)來求解數獨。OOP方法可以比擬為人的思考與行為角度。
