Repository: RobertOfTaiwan/SudokuStudyLib
Catalog: docs/source/locale/*/LC_MESSAGES/program.po
Languages: fr, ja, zh_cn, zh_tw

source: Start Programming to Solve a Sudoku
fr: Lancer Programmation pour résoudre un Sudoku
ja: 数独にPythonプログラムを書く
zh_cn: 撰写 Python 程式来解数独了
zh_tw: 撰寫 Python 程式來解數獨了

source: When we have created a sudoku simulate world in the computer to solve a sudoku, now we should go ahead to implement some methods which we solve it in our own hands. In other world, programming, is the stuff which we teach computer to do something that we have known it.
fr: Lorsque nous avons créé un monde de sudoku simulation dans l'ordinateur pour résoudre un sudoku, maintenant nous devons aller de l'avant pour mettre en œuvre des méthodes qui nous résoudre dans nos propres mains. En autre monde, la programmation, est la substance qui nous enseignons ordinateur de faire quelque chose que nous avons connue.
ja: 我々は、手書きを使用する方法を発見したものは停止ユニークなアプローチのための世界では良い数独コンピュータシミュレーションを構築したとき、我々は再度詳しく説明するため（これは、Pythonで）コンピュータ言語にそれを回すために始めることができます。条件で、プログラミング（プログラミング）と呼ばれる。プログラミングは、では、どのように我々は問題を解決するためにコンピュータを教える方法を実行しようとしていると見ることができる。
zh_cn: 当我们已经在电脑建构好一个数独模拟世界时，对那些我们以前使用手写的方式所发现的解数独方法，我们就可以着手来将其以电脑语言(这里是Python)来重新阐述。就术语来说，称为程式设计(Programming)。所以程式设计可以视为我们在教导电脑如何去执行我们解决问题的方法。
zh_tw: 當我們已經在電腦建構好一個數獨模擬世界時，對那些我們以前使用手寫的方式所發現的解數獨方法，我們就可以著手來將其以電腦語言(這裡是 Python)來重新闡述。就術語來說，稱為程式設計(Programming)。所以程式設計可以視為我們在教導電腦如何去執行我們解決問題的方法。

source: We first introduce the solve environment, then we will introduce some basic methods in this library.
fr: Nous présentons d'abord l'environnement résoudre, nous allons présenter quelques méthodes de base de cette bibliothèque.
ja: 最初に、我々は最初の数独全体の環境を解決するためのプロジェクトを紹介し、その後、我々は基本的な方法をいくつか説明します。
zh_cn: 一开始，我们先介绍这个专案整个求解数独的环境，然后我们再说明一些基本方法。
zh_tw: 一開始，我們先介紹這個專案整個求解數獨的環境，然後我們再說明一些基本方法。

source: Solving Environment
fr: environnement de résolution
ja: 環境を解く
zh_cn: 求解环境
zh_tw: 求解環境

source: We create a function solve() to do the real solving a sudoku, and we make two exception classes, SudokuDone, SudokuError to capture event happen when we use methods to solve a sudoku.
fr: Nous créons une fonction solve () pour faire la vraie résolution de sudoku, et nous faisons deux classes d'exception, SudokuDone, SudokuError pour capturer l'événement se produit lorsque nous utilisons des méthodes pour résoudre un sudoku.
ja: 我々はまた、2つのイベントのカテゴリ、SudokuDonとSudokuErrorを定義しながら、溶液プロセスに対処するために、数独を解くこの全体の入り口を行うには解決（）関数を設計し数独数独を解くかのルールに違反して条件を生成することが判明している。
zh_cn: 我们设计了solve() 这个函数来做整个求解数独的入口，另外也定义了两个事件类别，SudokuDon 及SudokuError，以处理求解过程中发现已经解开数独或者产生违反数独规则的状况。
zh_tw: 我們設計了 solve() 這個函數來做整個求解數獨的入口，另外也定義了兩個事件類別，SudokuDon 及 SudokuError，以處理求解過程中發現已經解開數獨或者產生違反數獨規則的狀況。

source: What is "Exception"?
fr: Quelle est "Exception"?
ja: 「**例外（例外）**」とは？
zh_cn: 什么是「**例外处理(Exception)**」？
zh_tw: 甚麼是「**例外處理(Exception)**」？

source: Exception is an event defined, when the event condition has occurred, system will stop the processing and jump to the exception processing. There are two major exceptions in the environment:
fr: Exception est un événement défini, lorsque la condition d'événement s'est produit, le système s'arrête le traitement et passer au traitement d'exception. Il existe deux grandes exceptions dans l'environnement:
ja: 「（例外）例外処理は、「システムが時事問題の処理を停止し、イベントハンドラにジャンプします、条件が満たされたときに、このイベントを構成し、イベント定義である。このプロジェクトには2つの主要な例外があります。
zh_cn: 「例外处理(Exceptions)」是一种事件定义，当构成这个事件的条件满足时，系统就会停止处理目前的事务，而跳到该事件的处理程序。在这个专案中有两个主要的例外处理：
zh_tw: 「例外處理(Exceptions)」是一種事件定義，當構成這個事件的條件滿足時，系統就會停止處理目前的事務，而跳到該事件的處理程序。在這個專案中有兩個主要的例外處理：

source: when the sudoku has been solved, will raise this exception
fr: lorsque le sudoku a été résolu, va soulever cette exception
ja: これは数独を解決されている場合には、この例外が起こされます
zh_cn: 当这个数独已经被解开时，这个例外处理会被叫醒
zh_tw: 當這個數獨已經被解開時，這個例外處理會被叫醒

source: when a country people to set in a house, but will break the rule of game, this will raise this exception
fr: quand un peuple de pays à mettre dans une maison, mais seront briser la règle de jeu, cela posera cette exception
ja: この例外に違反して見つかった数独のルールを解決するプロセスは起こされるいつ
zh_cn: 当求解过程中发现违反数独规则时，这个例外处理会被叫醒
zh_tw: 當求解過程中發現違反數獨規則時，這個例外處理會被叫醒

source: To let the environment know how many methods they can use to solve a sudoku, we create a class, SolveMethod. We use this class to create all methods in a BRAIN. We can treat this BRAIN like the god of this valley. Every time, when people don't how to choose their suitable houses, you can ask the god of valley, and it will give an answer, or it would say that, "**I don't know how to do either!**"
fr: Pour permettre à l'environnement sait combien les méthodes qu'ils peuvent utiliser pour résoudre un sudoku, nous créons une classe, SolveMethod. Nous utilisons cette classe pour créer toutes les méthodes dans un cerveau. Nous pouvons traiter ce cerveau comme le dieu de cette vallée. Chaque fois, quand les gens ne font pas la façon de choisir leurs maisons appropriées, vous pouvez demander au dieu de la vallée, et il vous donnera une réponse, ou il dire que, "** Je ne sais pas comment faire non plus! **"
zh_cn: 为了让整个求解环境能够知道有多少种求解方法它能够使用，我们设计了一个类别，SolveMethod。我们以这个类别来将所有的求解方法置入成一个**虚拟大脑**。我们可以将这个虚拟大脑视为是这个美丽山谷的守护神。每当有新进来此山谷者，找不到居住所时，都可以透过祂来选择出适合的房子，但祂也可能回答：「对不起，我也不知道该如何选择！」
zh_tw: 為了讓整個求解環境能夠知道有多少種求解方法它能夠使用，我們設計了一個類別，SolveMethod。我們以這個類別來將所有的求解方法置入成一個**虛擬大腦**。我們可以將這個虛擬大腦視為是這個美麗山谷的守護神。每當有新進來此山谷者，找不到居住所時，都可以透過祂來選擇出適合的房子，但祂也可能回答：「對不起，我也不知道該如何選擇！」

source: Every method register in the Brain as a SovleMethod object, they have these major properties:
fr: Chaque registre de la méthode dans le cerveau comme un objet SovleMethod, ils ont ces propriétés principales:
ja: 仮想脳****のために、内部に格納され、単一のSovleMethodオブジェクトに停止する方法の一人一人が、これらのオブジェクトは、次の主要な属性があります。
zh_cn: 对**虚拟大脑**而言，每一个解数独的方法都化为一个SovleMethod 物件储存在里面，这些物件有以下主要属性：
zh_tw: 對**虛擬大腦**而言，每一個解數獨的方法都化為一個 SovleMethod 物件儲存在裡面，這些物件有以下主要屬性：

source: fun: the function name of the method in python coding
fr: amusant: le nom de la fonction de la méthode de codage de python
ja: 楽しい：Pythonの関数名独法
zh_cn: fun: 解数独方法的 Python 函数名称
zh_tw: fun: 解數獨方法的 Python 函數名稱

source: idx: the index of the method, from the easier to the more difficult, the brain will use this sequence to solve a game one by one.
fr: idx: l'indice de la méthode, de la plus facile à la plus difficile, le cerveau va utiliser cette séquence pour régler un jeu de un à un.
ja: IDX：苦労して配置順に、1つずつを開始する簡単な方法から、ソートメソッド、仮想脳は、順番に数独を解決するためにこれらのメソッドを使用します。
zh_cn: idx: 方法的排序，从简单的方法开始到困难的方法依序排列，虚拟大脑将依序一个一个地使用这些方法来解开数独。
zh_tw: idx: 方法的排序，從簡單的方法開始到困難的方法依序排列，虛擬大腦將依序一個一個地使用這些方法來解開數獨。

source: name: the name of the method
fr: nom: le nom de la méthode
ja: 名前：このメソッドの名前、ユーザーが自分の名前をカスタマイズすることができます
zh_cn: name: 此方法的名称，使用者可以自订其名称
zh_tw: name: 此方法的名稱，使用者可以自訂其名稱

source: level: the difficult level for human, using to count a game's difficult level
fr: niveau: le niveau difficile pour l'homme, l'aide à compter niveau difficile d'un jeu
ja: レベル：難易度、人間の直感の面で。システムは独特の困難整数全体の数をカウントロックを解除するために使用します。
zh_cn: level: 困难度，对人的直觉而言。系统用此来计数解开整个数独的困难积分。
zh_tw: level: 困難度，對人的直覺而言。系統用此來計數解開整個數獨的困難積分。

source: Solving Process
fr: processus de résolution
ja: 解決プロセス
zh_cn: 求解过程
zh_tw: 求解過程

source: The following is the flow chart of solve():
fr: Voici l'organigramme de résoudre ():
ja: ここで、（）を解くと、メイン解決関数であり、フローチャート。
zh_cn: 下面是主要求解函数，solve()，的流程图：
zh_tw: 下面是主要求解函數，solve()，的流程圖：

source: **WORK or NOT WORK?**
fr: ** Travailler ou non? **
ja: ** '便利な（作品）」または「役に立たない」（機能しない）？ **
zh_cn: **「有用(work)」或「没用(not work)」？ **
zh_tw: **「有用(work)」或「沒用(not work)」？**

source: A method works or not means that using this method can:
fr: Une méthode fonctionne ou pas signifie que l'utilisation de cette méthode peut:
ja: 溶液法は、それがすることができることを意味し、「有用」である場合：
zh_cn: 一个求解方法如果是「有用」，表示它能够：
zh_tw: 一個求解方法如果是「有用」，表示它能夠：

source: let one or more people to find his or their own house,
fr: permettent une ou plusieurs personnes pour trouver son ou sa propre maison,
ja: 1つ以上の人々が彼らの家を見つけることをしましょう
zh_cn: 让一个或多个人找到他们的居所
zh_tw: 讓一個或多個人找到他們的居所

source: OR can let one or more houses know they are not allowed for some countries' people.
fr: OU peut laisser une ou plusieurs maisons savent qu'ils ne sont pas autorisés pour les personnes de certains pays.
ja: または家が1つ以上の国の1つ以上、人々が彼らの家に住むことができないことを知らせる
zh_cn: 或者是可让一间或多间房子知道一个或多个国家的人不能居住在他们的房子
zh_tw: 或者是可讓一間或多間房子知道一個或多個國家的人不能居住在他們的房子

source: In this flow chart, we know that:
fr: Dans ce diagramme, nous savons que:
ja: このフローチャートでは、我々は知っている：
zh_cn: 在这张流程图中，我们知道：
zh_tw: 在這張流程圖中，我們知道：

source: When a method works to set a person or reduce a house's allowed people, it will return to the first method to restart solving the game.
fr: Quand une méthode est de définir une personne ou réduire permis les gens d'une maison, il reviendra à la première méthode pour redémarrer la résolution du jeu.
ja: 人の居住地や家の便利セットは乗員の可能性を減らすことができるときにメソッドを解決するとき、全体の仮想脳はまず継続する解決のアプローチを解決するために戻ります。
zh_cn: 当一个求解方法有用时，设定了一个人的住所或降低了一间房子可居住者的可能性时，整个虚拟大脑会重新回到第一个求解方法来继续求解。
zh_tw: 當一個求解方法有用時，設定了一個人的住所或降低了一間房子可居住者的可能性時，整個虛擬大腦會重新回到第一個求解方法來繼續求解。

source: If a method can't work to solve a game, it will give the game to the next method to solve it.
fr: Si une méthode ne peut pas travailler à résoudre un jeu, il va donner le jeu à la méthode suivante pour le résoudre.
ja: それが解決するために次の方法に転送されたときに解決法が役に立たない場合。
zh_cn: 假如一个求解方法没用时，它会交给下一个方法来解决。
zh_tw: 假如一個求解方法沒用時，它會交給下一個方法來解決。

source: And if final method can't solve a game, it will go out and say "I can't figure out this game, sorry!"
fr: Et si la méthode finale ne peut pas résoudre un jeu, il va sortir et de dire "Je ne peux pas comprendre ce jeu, désolé! "
zh_cn: 当到最后一个方法都没用时，他会离开整个求解环境并说：「我无法解开这个游戏，抱歉！」
zh_tw: 當到最後一個方法都沒用時，他會離開整個求解環境並說：「我無法解開這個遊戲，抱歉！」

source: In the solving process, if "Done" or "Error" event occur, it will go out.
fr: Dans le processus de résolution de problèmes, si événement "error", "done" ou se produisent, il s'éteint.
ja: （完了）数独を解くか、数独のルール（エラー）に違反されたことが判明した場合の解決プロセスを通じて、それは全体の解決環境をオフにジャンプします。
zh_cn: 在整个求解过程中，如果发现已解开数独(Done)或者违反了数独规则(Error)时，它就会跳离整个求解环境。
zh_tw: 在整個求解過程中，如果發現已解開數獨(Done)或者違反了數獨規則(Error)時，它就會跳離整個求解環境。

source: Some Basic Methods
fr: Certaines méthodes de base
ja: いくつかの基本的な解法
zh_cn: 一些基本求解方法
zh_tw: 一些基本求解方法

source: Find every house in a group, if there is only one house that one country people can live there, that house must let that country's people to live in.
fr: Trouvez toutes les maisons dans un groupe, si il ya une seule maison que les gens d'un pays peuvent y vivre, cette maison doit laisser partir le peuple de ce pays à vivre po
ja: 各家のグループでは、すべての家をチェックし、もし唯一の家の人々は、田舎に住むことができそうであるならば、家が進出するその国の人々を維持するようにします。
zh_cn: 在每一个房子群组中，检查每一间房子，是否只有一间房子能够让某国的人民居住，如果是，则该间房子必然要让那国的人民迁入。
zh_tw: 在每一個房子群組中，檢查每一間房子，是否只有一間房子能夠讓某國的人民居住，如果是，則該間房子必然要讓那國的人民遷入。

source: When in a group(line or box) are only one left, it must allow only one country people to live there.
fr: Lorsque dans un groupe (ligne ou boîte) sont une seule gauche, il doit permettre un seul peuple du pays y vivent.
ja: ときに、グループの家ときだけ1が利用可能に、まだ収容されていない国の人々だけである必要があります。
zh_cn: 当一个房子群组中只剩一间空房时，那必然是只有一个国家的人民尚未入住。
zh_tw: 當一個房子群組中只剩一間空房時，那必然是只有一個國家的人民尚未入住。

source: Check every country people who has lived in a house, and when these people observe other boxes which has yet not lived their country people, can find an only house that allowed their country people or not?
fr: Vérifiez tous les gens de la campagne qui a vécu dans une maison, et quand ces gens observent d'autres boîtes qui a encore pas vécu leurs gens du pays, peut trouver une seule maison qui a permis à leurs gens du pays ou pas?
ja: すでに定住し、それぞれの国の国民を確認して、それらが相互作用の影響を受けているところを見て、あなたはそれがある場合は、残りの国民は、に定住するようにできるように、家を見つけることができれば、まだブロックが滞在する国の人々が存在し、明らかにその国の人々を与えるために、家に割り当てることができます。
zh_cn: 检查每一个国家中已经定居的国民，看他们所在的位置所交互影响、而尚未有该国人民入住的区块中，是否可以找到仅剩一间房子容许该国国民来定居，如果是，则可以很明显地配给该房子给与该国的人民。
zh_tw: 檢查每一個國家中已經定居的國民，看他們所在的位置所交互影響、而尚未有該國人民入住的區塊中，是否可以找到僅剩一間房子容許該國國民來定居，如果是，則可以很明顯地配給該房子給與該國的人民。

source: It is the same method as check_obvious_number, but some boxes' houses are formed as a **Group Number**.
fr: C'est la même méthode que check_obvious_number, mais quelques maisons de boîtes sont formés comme un numéro de groupe ** **.
ja: この解法とは同じcheck_obvious_numberが、彼らは他の人を検出するのに十分に一緒に定住し、まだブロックが自国民の生活しているように、最初の人々の中には、仮想ブロックを見つけること。
zh_cn: 这个求解方法与check_obvious_number 相同，只是先找到一些区块的虚拟国民，让他们以及已定居的国民一起来探测其他尚未有本国国民居住的区块。
zh_tw: 這個求解方法與 check_obvious_number 相同，只是先找到一些區塊的虛擬國民，讓他們以及已定居的國民一起來探測其他尚未有本國國民居住的區塊。

source: What is a **Chain**?
fr: Qu'est-ce qu'un chaîne ** **?
ja: 「****連鎖（チェーン）」とは？
zh_cn: 什么是「**链结(Chain)**」？
zh_tw: 甚麼是「**鏈結(Chain)**」？

source: Chain is formed by two or above houses. In these houses, the amount of all different possible countries' people are equal to the amount of the houses. When a chain have formed, we can reduce the possible countries' people from the other houses in the same group of this chain.
fr: Chaîne est formée par deux ou au-dessus des maisons. Dans ces maisons, le montant de la population tous les différents pays possibles est égal au montant des maisons. Quand une chaîne ont formé, nous pouvons réduire la population des pays possibles des autres maisons dans le même groupe de cette chaîne.
ja: 「連鎖（チェーン）」は、同じ家から空の家屋からなる二以上の基である。これは、すべてのこれらの家に住んでいることができるかもしれ形成された要素の総数に等しいた家のそれらとこれらの国々の住宅の総数。だから我々はこれらの家は、リンクを形成すると言うことができます。これらの国々の人々はこれらの家に住むことができ、同じ家の他のグループの空の家はこれらの国に住んでいることはもはや不可能である。
zh_cn: 「链结(Chain)」是由同一个房子群体中两个或以上的空房子所组成。形成的要件就是这在这些房子中所有可能能够居住在这些房子里面的国家总数与这些房子的总数相等。如此我们就可以说这些房子形成了一个链结。这些国家的人都只能居住在这些房子上，而在同一房子群体的其他空房子则不再可能居住这些国家的人民。
zh_tw: 「鏈結(Chain)」是由同一個房子群體中兩個或以上的空房子所組成。形成的要件就是這在這些房子中所有可能能夠居住在這些房子裡面的國家總數與這些房子的總數相等。如此我們就可以說這些房子形成了一個鏈結。這些國家的人都只能居住在這些房子上，而在同一房子群體的其他空房子則不再可能居住這些國家的人民。

source: If there is a **Group Number** in a box, the empty houses of its same direction could be reduce the possible country people of this Group Number.
fr: Si il ya un numéro de groupe ** ** dans une boîte, des maisons vides de son même sens pourrait être de réduire les gens possibles de pays de ce numéro de groupe.
ja: もし人々が、他の空の家のグループ内の仮想の家と同じ方向に、それはこの国に住んでいることは不可能である家の中で、国家仮想ブロックの形成。
zh_cn: 如果在一个房子区块中形成了一个虚拟国民时， 那与这个虚拟国民同方向的房子群组中的其他空房子，就不可能居住这个国民。
zh_tw: 如果在一個房子區塊中形成了一個虛擬國民時， 那與這個虛擬國民同方向的房子群組中的其他空房子，就不可能居住這個國民。

source: As the houses have been lived some people, this would make some empty houses reduce some possible countries' people. And then these empty houses in a group(x-way line, y-way line, box) may form a **Chain**.
fr: Comme les maisons ont été vécu certaines personnes, cela ferait quelques maisons vides réduisent les gens de certains pays possibles. Et puis ces maisons vides dans un groupe (ligne X-Way, y de ligne de chemin, boîte) peuvent former une chaîne ** **.
ja: 家の数が住んでし始めたとき、それは家の中には、もはやそのため、家グループ（X軸、Y軸、ブロック）内の空の家は、キーチェーンを制作できたいくつかの国の居住者を許可することができます影響を与えません。**（チェーン）**。この方法は、可能なキーチェーン、キーチェーン、空の家を見つけ、これらのキーチェーンに生きている自国民の潜在的な影響を軽減することである。
zh_cn: 当一些房子开始住人以后，会影响一些房子不再能够允许一些国家的居民，而这些空房子可能因此在一个房子群组中(x轴、y轴、区块)中产生了一个**键链(Chain)**。这个方法就是去寻找可能的键链，并将键链所影响的空房子减少它们被这些键链的国民居住的可能。
zh_tw: 當一些房子開始住人以後，會影響一些房子不再能夠允許一些國家的居民，而這些空房子可能因此在一個房子群組中(x軸、y軸、區塊)中產生了一個**鍵鏈(Chain)**。這個方法就是去尋找可能的鍵鏈，並將鍵鏈所影響的空房子減少它們被這些鍵鏈的國民居住的可能。

source: How to implement a method?
fr: Comment mettre en œuvre une méthode?
ja: それを解決するためのメソッドを実装する方法？
zh_cn: 如何去实作一个求解方法呢？
zh_tw: 如何去實作一個求解方法呢？

source: We could implement a method called check_obvious_for_a_country(m, num) method as an example:
fr: Nous pourrions mettre en œuvre une méthode appelée check_obvious_for_a_country (m, num) méthode, par exemple:
ja: 私達はちょうど私達がcheck_obvious_for_a_country（M、NUM）として注文、人々は国がブロックけれども国の住民のための避難所を実行する検索する直感的な方法を持っているかどうかのために実装する必要があります。
zh_cn: 我们来实作一个只为一个国家的人民来看是否能有一个直觉的方法来为一个尚未有该国住民的区块找到住所，我们命为check_obvious_for_a_country(m, num)：
zh_tw: 我們來實作一個只為一個國家的人民來看是否能有一個直覺的方法來為一個尚未有該國住民的區塊找到住所，我們命為 check_obvious_for_a_country(m, num)：

source: line#1, define a method, *m* is the world of this game, and **num** is a country id, here is 1-9.
fr: ligne n ° 1, définir une méthode, * m * est le monde de ce jeu, et ** nombre ** est un identifiant de pays, voici 1-9.
ja: ライン＃1、解決方法を定義し、* m *は世界に一人のゲームの数、** numは**可能な値は1-9である、国コードです。
zh_cn: line#1, 定义一个求解方法, *m* 是这个游戏的数独世界，**num** 则是一个国家代码, 可能值为1-9。
zh_tw: line#1, 定義一個求解方法, *m* 是這個遊戲的數獨世界，**num** 則是一個國家代碼, 可能值為1-9。

source: line#3, starts to find the all people who have lived in a house of a country.
fr: ligne n ° 3, commence à trouver les toutes les personnes qui ont vécu dans une maison d'un pays.
ja: ライン＃3は、それぞれがこの谷に住んでいる、この国の国民は、彼らの家を見つけなければなりません。
zh_cn: line#3, 将每一个已经入住此山谷的此国国民都找出他们的住所。
zh_tw: line#3, 將每一個已經入住此山谷的此國國民都找出他們的住所。

source: line#4-9, it scan all its effect boxes if those have not been checked.
fr: ligne # 4-9, le scanner toutes ses boîtes d'effet si ceux n'ont pas été vérifiées.
ja: ライン＃4-9、すべての家をチェックすると、まだブロックがチェックされていない。
zh_cn: line#4-9, 检查每一个尚未被检查的房子区块。
zh_tw: line#4-9, 檢查每一個尚未被檢查的房子區塊。

source: line#10-11, it the country people have live in this box, ignore it.
fr: ligne # 10-11, il les gens du pays ont en direct dans cette zone, l'ignorer.
ja: ライン＃10月11日、このブロックは、居住国の人々されている場合は、それがチェックされていません。
zh_cn: line#10-11, 如果此区块已有该国人民居住，那就不用检查了。
zh_tw: line#10-11, 如果此區塊已有該國人民居住，那就不用檢查了。

source: line#12-19, check all empty houses in this box which allow the country's people or not, if yes, put it in the Possible List.
fr: ligne # 12-19, vérifier toutes les maisons vides dans cette boîte qui permettent les gens du pays ou pas, si oui, le mettre dans la liste des possibles.
ja: ライン＃12月19日、人々は田舎に住んで来ることができるように、このブロックは、すべての利用可能かどうかを確認してください。イエスならば、内部の可能な家のリストに移動します。
zh_cn: line#12-19, 检查此区块每一个空房是否可以让该​​国的人民来居住。如果是，则将该房子放进去可能的名单里面。
zh_tw: line#12-19, 檢查此區塊每一個空房是否可以讓該國的人民來居住。如果是，則將該房子放進去可能的名單裡面。

source: line#20-21, if the Possible List has only one house, it must can be assigned this house to the country's people.
fr: ligne # 20-21, si la liste des possibles ne dispose que d'une maison, il faut peut être attribué à cette maison pour les gens du pays.
ja: 一度だけがある場合、行番号20〜21、可能性の最終チェックリストは、それは家がその国の人々が生きるためにバインドされていることを意味します。
zh_cn: line#20-21, 最后检查可能的名单中，如果只有一个时，那就表示该房子必然由该国人民来居住。
zh_tw: line#20-21, 最後檢查可能的名單中，如果只有一個時，那就表示該房子必然由該國人民來居住。
