Repository: RobertOfTaiwan/SudokuStudyLib
Catalog: docs/source/locale/*/LC_MESSAGES/sudoku.po
Languages: fr, ja

source: Package: Sudoku - the OOP method
fr: Package: Sudoku - la méthode de la programmation orientée objet
ja: 詳細なプログラム：数独キット

source: This is the oop method to solve the Sudoku.
fr: C'est la méthode de oop pour résoudre le Sudoku.
ja: これは、数独ライブラリーを解決するために、オブジェクト指向プログラミングの使用である

source: A 3x3 Box Object
fr: Un 3x3 Box Object
ja: ハウスブロックグループカテゴリ

source: int, the box's id
fr: int, id la boîte
ja: INT、このグループのコード

source: the Point object list of this object
fr: la liste des objets de point de cet objet
ja: Pointオブジェクトは、このグループリストに属している

source: This will replace the original GroupBase's init()
fr: Il remplacera init du GroupBase original ()
ja: これは女性のカテゴリ、GroupBase、INIT（）に置き換えられます

source: if the unassigned num in this box which it's all possible positions have the same direction, we call it as a GroupNumber
fr: si le nombre non affectée dans cette zone qui c'est toutes les positions possibles ont la même direction, nous l'appeler comme un GroupNumber
ja: もしブロックグループ内のすべてのコードを埋めるためになかった場合は、このPointオブジェクトを充填することができるnumは、numは同じx-y軸座標を有し、我々はグループNumerを呼ばれる。

source: int, find this num, it is a group number in this box
fr: int, trouver ce nombre, il s'agit d'un numéro de groupe dans cette zone
ja: INTは、グループ番号のブロックグループのコードを見つけること

source: list, the Point object list which to find a group number, if it is empty, the function will get all unassigned points to be a list
fr: liste, la liste des objets Point qui pour trouver un numéro de groupe, si elle est vide, la fonction obtenir tous les points non attribués à une liste
ja: それが空白の場合は、リスト、グループ番号を見つけるために、そこから、機能ブロックオブジェクトは、すべての空白PointオブジェクトをPointオブジェクトのリストを取得します。

source: bool, to call get_all_pos to not include x-line's unassigned point
fr: bool, pour appeler get_all_pos de ne pas inclure le point de non affecté x-line
ja: BOOL、コールget_all_pos（）は、x軸の有無にかかわらず、空白のスポットを設定した場合。

source: bool, as above, but y-line
fr: bool, comme ci-dessus, mais y-ligne
ja: BOOL、コールget_all_pos（）は、空白のスポットを設定するか、Y軸が含まれていない場合があります。

source: GroupNumber, none or a GroupNumber Object
fr: GroupNumber, aucun ou un objet GroupNumber
ja: GroupNumber、なしまたはオブジェクトGroupNumber

source: A chain of two and above positions which are not in the same box but in the same line and can form a chain, means the possible number in this chain positions only can be filled in these positions
fr: Une chaîne de deux positions au-dessus et qui ne sont pas dans la même boîte, mais dans la même ligne, et peuvent former une chaîne, désigne le nombre possible de cette chaîne positions ne peut être remplie à ces positions
ja: チェーン（チェーン）は、これらの点上のコードの総数は、最大2つ以上のブランクスポットの同じグループで構成されているので、他の空白のスポット内の同じグループで、ポイント数と正確に一致に充填することができるこのリンクコードのすべてを満たすことは不可能。

source: int list, presents the numbers of this chain
fr: int list, présente les chiffres de cette chaîne
ja: int型のリスト、リンクコードのすべての代表者のリスト

source: Point list, presents the positions that form the chain
fr: Liste Point, présente les positions qui forment la chaîne
ja: ポイントリスト、リンク上のすべてのブランクスポットの代表のリスト

source: The Base Class of a Line or Box
fr: La classe de base d'une ligne ou Box
ja: 基本的なカテゴリーの（x軸、y軸、ブロックおよび他の基を含む）すべてのグループクラス

source: The init function of a GroupBase object
fr: La fonction d'initialisation d'un objet GroupBase
ja: 最初のグループ·クラスの基本的な機能（INIT（））

source: int, the id of this object
fr: int, l'identifiant de cet objet
ja: INT、このオブジェクトコード

source: the point object list in this object
fr: la liste des objets de point de cet objet
ja: Pointオブジェクトこのオブジェクトは、リストに属し

source: check the group can be filled the number(v)?
fr: vérifier le groupe peut être rempli le nombre (v)?
ja: オブジェクトがこのグループコード（V）に挿入することができるかどうかをチェックする？

source: int, the number to be checked
fr: int, le nombre à vérifier
ja: int型、検査対象のコード

source: True or False
fr: Vrai ou faux
ja: 「はい」または「いいえ」

source: get the un-assigned position in this group, and possible numbers only in [count] positions
fr: obtenir la position non affecté dans ce groupe, et les nombres possibles que dans [count] positions
ja: このグループ内のすべての空白のスポットのリストを取得し、残りの図の[count]ポイント上で充填することができる。

source: The output format is a tuple list, the tuple has two value, one is number, another is s position list
fr: Le format de sortie est une liste de tuple, tuple a deux valeur, on est plusieurs, une autre est de la liste de position
ja: 出力はタプルのリストで、このタプルは2値が含まれ、1は数字、他の物点のリストである

source: int, how many positions are un-assigned to get
fr: int, combien de postes sont non affecté à obtenir
ja: intが、達成されるべき指し

source: list, [(num,[p1, p2...]),...]
fr: liste, [(num, [P1, P2 ...]) ...]
ja: フォーマットのリスト、[（数値、[P1、P2...]）、...]

source: get position list in this group
fr: obtenir la liste de position dans ce groupe
ja: このグループのPointオブジェクトのリストを取得します

source: list, exclude the positions in it
fr: liste, exclure les positions dans ce
ja: 収縮したと指摘して除外するリスト、

source: char, a: all, s:has assigned, u:not assigned
fr: char, un: tout, s: a cédé u: pas affecté
ja: CHAR、：すべて、S：非ブランク、U：空白

source: int, if method is u and set the number to 1-9, will get all possible pos which are possible to be assigned the num
fr: int, si la méthode est u et définir le nombre de 1-9, obtiendra tous pos possible qui sont possibles à affecter le nombre
ja: ときUの方法であれば、INT、およびこのパラメータが1-9に設定されている、それはすべての空白のスポットが、この数を収容することができます取得します

source: bool, exclude the x line's positions
fr: bool, exclure les positions de la ligne de x
ja: BOOL、ポイントが含まれているか、X軸が含まれていません

source: bool, exclude the y line's positions
fr: bool, exclure les positions de la ligne y
ja: BOOL、ポイントが含まれているか、Y軸が含まれていません

source: bool, if set, check it, if it is True, just get the chain positions, or get the un-chained positions
fr: bool, si elle est définie, le vérifier, si elle est vraie, juste obtenir les positions de la chaîne, ou d'obtenir des positions de l'ONU à chaîne
ja: BOOLには、チェーン、チェック·ポイントまたはポイントではないチェーンを取得するには、このパラメータを設定した場合

source: int, if method="u" and possibles!=None, it will only get the possible set's length = possibles
fr: int, si method = "u" et possibles! = Aucun, il ne fera que la longueur de l'ensemble possible = possibles

source: list: a List of Position
fr: liste: une liste de la situation
ja: リスト：Pointオブジェクト一覧

source: get the position of a group which have been filled the number(v
fr: obtenir la position d'un groupe qui ont été remplis le nombre (v
ja: デジタル点vのグループを埋めるために行われて

source: int, the number to be found its position
fr: entier, le nombre que l'on trouve sa position
ja: INTは、デジタルポイントを取得したい

source: None or a Point object
fr: Aucun ou un objet Point
ja: なし、またはPointオブジェクト

source: Group Number in Box
fr: Groupe Nombre dans la boîte
ja: ブロックグループグループ数

source: int, the Box Object Idx
fr: int, l'objet Boîte Idx
ja: int型、ブロックグループコード

source: int, the number that the object presents
fr: entier, le nombre que les presents d'objets
ja: INT、このオブジェクトは、図面を充填し

source: Point List, the Point Object List that form this Group Number
fr: Point de liste, la liste d'objets Point qui forment ce numéro de groupe
ja: ポイントリスト、グループ番号ポイントの対象リストの生成

source: char, "x" or "y" means the direction of this Group Number
fr: char, "x " ou "y" signifie que la direction de ce numéro de groupe

source: int, the line(x or y) index
fr: int, la ligne (x ou y) index
ja: int型、コードグループのx軸またはy軸

source: Line of X
fr: Ligne de X
ja: X軸のグループ

source: Line of Y
fr: Ligne de Y
ja: y軸の基

source: A Table of a Sudoku
fr: Un tableau d'un Sudoku
ja: 数独、オブジェクト全体

source: file, the define file of a sudoku
fr: fichier, le fichier d'un sudoku définir
ja: ファイル、数独の初期化ファイル

source: Properties:
fr: propriétés:
ja: 属性：

source: rec: list of (x, y, v, t, d), the record of all the solving steps
fr: rec: liste de (x, y, v, t, d), le record de tous les étapes de résolution
ja: rec視聴：フォーマット【の（x、y、V、T、d）は、...]解決するレコードのリスト

source: filled: int, the amount of assigned points
fr: rempli: int, le nombre de points attribué
ja: いっぱい：INTは、ポイントを充填した

source: done: bool, if solved or not
fr: fait: bool, si résolu ou non
ja: 行われます。BOOL、解決するかどうか

source: error: bool, if there is an error occurs
fr: erreur: bool, si il ya une erreur se produit
ja: エラー：BOOL、エラーが発生したかどうか

source: lineX: LineX list
fr: LinEx: liste LineX
ja: LINEX：X軸·グループ·オブジェクトのリスト

source: lineY: LineY list
fr: Liney: liste Liney
ja: 線を引いた：グループオブジェクトのリストのY軸

source: b: Box List
fr: b: Zone de liste
ja: B：ブロックグループオブジェクトリスト

source: p: a two dimensions of list of Point
fr: p: un deux dimensions de la liste des points
ja: pは二次アレイ点リスト

source: n: Number list
fr: n: Liste des numéros
ja: N：デジタルオブジェクト一覧

source: chain: Chain list
fr: chaîne: liste de chaîne
ja: チェーン：チェーン（連鎖）オブジェクトリスト

source: Checking if the position x, y, can be set the value v
fr: Vérifier si la position x, y, peut être réglée à la valeur v
ja: 座標を確認して（x、y）の点（ポイント）のオブジェクトは、数vを入力することができます

source: int, x position
fr: int, position x
ja: int型、X座標

source: int, y position
fr: int, position y
ja: INT、y座標

source: int, the number
fr: entier, le nombre
ja: 数字を埋めるために、int型

source: get the position list which can see the position, p
fr: obtenir la liste de position qui peut voir la position, p
ja: ポイントは、すべてのポイントオブジェクトのリストを参照してください（P）を見ることができます作られ

source: char, "u": un-assigned positions, "a": all, "s": assigned positions
fr: char, "u": positions non attribuées, "a": tous, "s": postes affectés

source: if method="u", the position must have be possible to be filled the number
fr: si la méthode = "u", la position doit avoir être possible de remplir le nombre

source: Point list
fr: Liste Point
ja: 点オブジェクトのリスト

source: get all positions, to call the :meth:GroupBase.get_all_pos function to get it
fr: obtenir toutes les positions, d'appeler le: meth: GroupBase.get_all_pos fonctionnent pour l'obtenir
ja: 取得するために）（GroupBase.get_all_posを呼び出すことによって、すべてのポイントのオブジェクトリストを取得します

source: Point list, other than the postions in this list
fr: Liste de point, autre que les postions dans cette liste
ja: Pointオブジェクトのリストは、リスト上のこれらの点を除外

source: char, "a" -- all, "u" -- unassigned, "s" -- assigned
fr: char, "a" - tous, "u" - non attribué, "s" - attribué

source: int, the unassigned position which has the [num] in its possible numbers
fr: int, la position non affecté qui a le [nombre] dans ses numéros possibles
ja: INT、ギャップは[数字]この数字を埋めるようにすることができなければなりません

source: int, if set, only get the unassigned positions that those possible numbers are equal to it
fr: int, si elle est définie, seulement obtenir les postes non affectés que ces chiffres sont possibles égale à elle
ja: int型のみpossiblesのデジタルポイントの合計を埋めるためにそこに行われる場合は、このパラメータを設定する

source: Print all the steps of solving process
fr: Imprimer toutes les étapes du processus de résolution
ja: 溶液プロセスのすべてを印刷

source: Read Sudoku's Define from file
fr: Lire Sudoku définissons à partir du fichier
ja: 数独定義ファイルを読む

source: file, the sudoku define file, can give it the absolute path name, if only the file name, it would find file in the data path.
fr: fichier, les sudoku définissent fichier, peut lui donner le nom de chemin d'accès absolu, si ce n'est que le nom du fichier, il serait de trouver le fichier dans le chemin de données.
ja: ファイル名だけを与えた場合のファイル、数独定義ファイルは、あなたが、絶対ファイルのアドレスを与えることができ、システムがファイルを取りに行くためにディレクトリデータの下にインストールされます

source: reduce the position(x, y)'s possible numbers from v
fr: réduire la position (x, y) de nombres possibles de v
ja: 座標（x、y）を充填することができる番号のリストを指し、この番号を削除し、ν

source: int, the possible number
fr: entier, le nombre possible
ja: int型、デジタルの可能性が除去される

source: str, the description of solving
fr: str, la description de la résolution
ja: STR、回答の説明を表示

source: bool, check or not
fr: bool, vérifier ou pas
ja: BOOL、あなたがチェックしたい場合は、

source: str, the details of solving
fr: str, les détails de la résolution
ja: STRの詳細な説明への答えを得る

source: int, as following code
fr: int, le code de la manière suivante
ja: int型、後述するように

source: 2: if set a number,
fr: 2: si défini un certain nombre,
ja: 2：あなたが番号を設定した場合

source: 1: if just set number
fr: 1: si seulement définir le nombre
ja: 1：数値は単なる削減である場合

source: 0: if is not in the possible set, if check is True, it will raise an SudokuError exception
fr: 0: si n'est pas dans le jeu possible, si le chèque est vrai, il pose une exception SudokuError
ja: 0：チェックがTrueの場合に番号を和らげることができず、この例外が開始されますSudokuError

source: set the position x, y to be the number v
fr: définir la position x, y pour être le nombre v
ja: オブジェクトポイントvの座標値（x、y）の設定

source: int, the number of this position
fr: entier, le nombre de cette position
ja: INTは、デジタルを設定する

source: str, the description of the solving
fr: str, la description de la résolution
ja: STR、回答の説明を表示

source: str, the detail methods of the solving
fr: str, les méthodes de la résolution de détail
ja: STRの詳細な説明への答えを得る

source: int, >=1 if set successfully, 0 if it can't be set the number v
fr: int, = 1 si réglé avec succès, 0 si elle ne peut pas être réglé le nombre v
ja: INT、=1：セットアップが成功した場合、0：失敗した場合

source: Get unassign position's possible number list, format is [p1, p2,...] and Sorted By the possible numbers
fr: Faites possible la liste des numéros de poste désaffecter, le format est [p1, p2, ...] et de classement par les nombres possibles
ja: [P1、P2、...]の形式でグループリスト内の空白部分を取得し、高低から排出許可桁数の合計を記入

source: 0 for all, >=2, mean get only the possible numbers for it
fr: 0 pour tout, = 2, signifie obtenir que les numéros possibles pour elle
ja: 0：すべての取得、=0：数字のみが空白の合計数を終了点のリストを取得することができます

source: Number Object
fr: nombre d'objets
ja: デジタルオブジェクト

source: You can imagine that an object of this class is equal to a country, every country has its own id from 1-9.
fr: Vous pouvez imaginer qu'un objet de cette classe est égal à un pays, chaque pays a sa propre id par 1-9.
ja: このクラスの国の唯一のオブジェクトを想像することができ、それぞれの国が1から9まで、独自のコードを持っています。

source: int, the id of the Number, from 1 to 9
fr: int, l'identifiant du numéro, de 1 à 9
ja: 1〜9のint、このオブジェクトコード、

source: Check if the position, p1, can be seen of all this number's group number
fr: Vérifiez si la position, p1, peut être vu du numéro de groupe de tout ce numéro
ja: この点を確認し、P1、グループ番号を参照してください、この図の（番号）を作成することができます

source: Point, a position
fr: Point, une position
ja: ポイント、Pointオブジェクト

source: gn if can be seen by it, or None
fr: gn si on peut le voir par elle, ou Aucun
ja: あなたはグループ番号オブジェクトを取得する場合は、[なし]、そうでなければ、見ることができない

source: save assigned position in the p list
fr: enregistrer la position assignée dans la liste des p
ja: このリストにないすべての空のP点を保存

source: Point, a position that are assigned to this object
fr: Point, une position qui sont affectés à cet objet
ja: ポイントは、このオブジェクトのポイントオブジェクトへの帰属

source: A Position in a Sudoku's table
fr: Une position à la table d'un Sudoku
ja: 数独の表のポイント

source: We can imagine that a Point object is an house
fr: Nous pouvons imaginer que un objet Point est une maison
ja: あなたはすべての点オブジェクトを想像することができます家です

source: This is the init of Point Object
fr: C'est l'initialisation de Point Object
ja: これは、プログラムの開始点（ポイント）オブジェクト化（init（））である

source: int, the x position of this object
fr: int, la position x de cet objet
ja: intが、このオブジェクトのx座標

source: int, the y position of this object
fr: int, la position y de cet objet
ja: int型、オブジェクトのy座標

source: Check this position can see p1?
fr: Vérifiez cette position peut voir p1?
ja: このオブジェクトが別のポイント·ポイント（P1）を見ることができるかどうかをテストする？

source: Point, a point object
fr: Point, un objet point
ja: ポイント、Pointオブジェクト

source: int, the value can't be 3 or 7 it means the same pos
fr: int, la valeur ne peut pas être 3 ou 7, cela signifie la même pos
ja: int型は、この値は同じポイントを表し、3か7にすることはできません

source: return code:
fr: Code de retour:
ja: リターンコード：

source: 0: can't see p1
fr: 0: ne peut pas voir p1
ja: 0：あなたは、点p1を見ることができない

source: 1: can see it in x line
fr: 1: peut le voir dans x ligne
ja: 1：これは、x軸に見ることができる

source: 2: can see it in y line
fr: 2: peut le voir dans la ligne y
ja: 2：これは、y軸に見ることができる

source: 4: can see it in the box
fr: 4: peut le voir dans la boîte
ja: これは、ブロック群に見られる

source: check this position can see which positions in the posList
fr: vérifier cette position peut voir ce qui positionne dans le posList
ja: テストは、そのポイントのポイント（POSLIST）のリストを参照して、この点を見ることができます

source: list, a [(x, y),...] list
fr: liste, un [(x, y), ...] liste
ja: リストは、リスト形式[（x、y）は、...]

source: list, [(x, y),...
fr: liste, [(x, y), ...
ja: リストは、リスト形式[（x、y）は、...]

source: Method Object
fr: méthode objet
ja: 課題を解決するMethodオブジェクト

source: function, the function name defined in Python
fr: fonction, le nom de la fonction définie en Python
ja: カルバートでのPythonのプログラム名で定義された関数を、

source: int, the sequence of executing solving
fr: int, la séquence d'exécution de la résolution
ja: INT、実行の最初の注文を修復

source: str, the description of this function
fr: str, la description de cette fonction
ja: STR、解決のこの方法に名前を付ける

source: int, the difficult level
fr: int, niveau difficile
ja: 整数、この解法の難易度、値が高いほど、より困難

source: bool, is it a obvious method for a human
fr: bool, est-ce une méthode évidente pour un homme
ja: BOOL、人々のために、どうか、直感的なアプローチは、目視を使用することです

source: To execute a method to solve a sudoku
fr: Pour exécuter une méthode pour résoudre un sudoku
ja: ロックを解除するために数独ゲームを解決するための方法の実現

source: Matrix object
fr: Objet Matrix
ja: オブジェクト全体としての数独の世界

source: first(int), only(bool)
fr: premier (int), seul (bool)
ja: 最初の（INT）：開始番号（INT）、のみ（ブール値）：わずか数をチェック

source: tuple, (sets, reduces, method index, first, only), as following
fr: tuple, (jeux, réduit, l'indice de méthode, d'abord, seulement), comme suit
ja: タプルの形式は以下のように、その意味は、（セットは、メソッド指数は、まず、のみ、低下させる）。

source: sets: int, the amount of set a number
fr: ensembles: int, le montant de définir un certain nombre
ja: セット：INT、ポイント数を設定

source: reduces: int, the amount of reduce a number
fr: réduit: int, le montant de réduire un certain nombre
ja: 低減します。int、ポイント数を削減

source: mothod index: int, method Index to restart using
fr: indice Mothod: int, méthode Indice de redémarrer à l'aide
ja: 优先インデックス：int型、戻り値は、解決方法をジャンプした後、

source: first: int, the first number to scan for the methods need this information
fr: première: int, le premier numéro de scanner pour les méthodes besoin de cette information
ja: 最初：INT、別のスタート解法デジタルソリューションを作るために戻るとき

source: only: bool, if only check the first number or not
fr: seulement: bool, si ce n'est que le premier numéro de vérifier ou non
ja: のみ：BOOL、同法を解決するために、他の解決策をできるように戻った後、最初の数は、アドレス

source: To Store running condition
fr: Pour stocker état ​​de marche
ja: ストア実行状況

source: int, the index of the methods loops
fr: int, l'indice des méthodes boucles
ja: int型、サイクルインデックス番号を解く

source: int, the method idx which run now
fr: int, la méthode idx qui courent maintenant
ja: INT、この方法は、現在使用されているインデックス番号を解く

source: Point list, set this variable, if you want to make an exception when this position has been set
fr: Liste de point, définir cette variable, si vous voulez faire une exception lorsque cette position a été mis en
ja: このリストを設定した場合、そのうちの一つが設定されるとき、リストの点リスト、座標（x、y）、、、システムは処理を停止する

source: bool, if the every un-assigned positions have been writen down their possible number?
fr: bool, si les tous les postes non affectés ont été writen réduire leur nombre possible?
ja: ブール、ギャップがシミュレーションされたか否かを、それらが少数に充填することができると書い

source: int, to set the possibles when using emulate method, for both positions and numbers
fr: int, pour définir les possibles lors de l'utilisation méthode émuler, pour les deux positions et des numéros
ja: int型は、点または数字の可能な数を含む、シミュレーション時間の使用を制限することができる

source: list of (m, x, y, idx)
fr: liste des (m, x, y, idx)
ja: 【（mは、X、Y、idxの）、...]リストの形式

source: m: Matrix object, the Matrix copy before try to set (x, y) to be the idx of possible numbers
fr: m: objet Matrix, la copie de la matrice avant d'essayer de mettre en (x, y) d'être le idx des numéros possibles
ja: M：Matrixオブジェクト、点（x、y）が返信することができるように、バックアップするために、最初のIDX確数に設定される前に

source: x: int, the position x of trying
fr: x: int, la position x d'essayer
ja: X：int型、x座標をしようとする

source: y: int, the position y of trying
fr: y: int, la position y d'essayer
ja: Y：int型、Yは、試してみるの座標

source: idx: int, the index of the possible numbers, starting from 0
fr: idx: int, l'indice des numéros possibles, à partir de 0
ja: idxの：int型、インデックス値の数は、0から開始してもよい

source: int, the depth index of trying
fr: int, l'indice de la profondeur d'essayer
ja: int型、解があるときにメソッドが、これは数回、この方法を行うことが第一であることがすでに投機であるインデックス値の深さを推測

source: bool, if using Guess method or not
fr: bool, si vous utilisez la méthode Guess ou pas
ja: ブール値、使用するかどうかを推測する

source: bool, if using emulator methods or not
fr: bool, si vous utilisez les méthodes de l'émulateur ou pas
ja: シミュレーションを使用するかどうかをBOOL、

source: int, the difficult level of this sudoku
fr: int, le niveau difficile de ce sudoku
ja: INT、この数独の難しさ

source: int, the level Limit, 0 means no limit
fr: int, la limite de niveau, 0 signifie pas de limite
ja: 制限なし：限定の難しさ、0を解決する方法を用いて、int型

source: Matrix, the init Matrix
fr: Matrix, Matrix init
ja: 初期化マトリックス、Matrixオブジェクト

source: Matrix, the now Matrix
fr: Matrix, la Matrice maintenant
ja: 行列は、現在の数独オブジェクト

source: bool, if print the steps of solving
fr: bool, si imprimer les étapes de résolution
ja: BOOL、印刷するかどうかの手順を解く

source: str, record now path
fr: str, fiche maintenant chemin
ja: STR、現在の作業ディレクトリ

source: An exception When the table has been filled 81 positions
fr: Une exception Lorsque le tableau a été rempli 81 postes
ja: 一つの例外処理、各点が満たされたときに数独ゲームを生成する

source: int, last position x, when done
fr: int, dernière position x, lorsque vous avez terminé
ja: 数独は、最後の点のx座標、終わっ解くINT、

source: int, last position y, when done
fr: int, dernière position y, lorsque vous avez terminé
ja: INTは、数独ソリューションを終えたとき、yは最後の点の座標

source: int, the last number be set, when done
fr: int, le dernier numéro sera réglé, lorsque vous avez terminé
ja: 数独は、最後のポイントは、数字を記入されて、終わっ解くINT、

source: An exception when x, y can't be set or reduce to or form the number v t: is the type: 's' means set, 'r' means reduce
fr: Une exception lorsque x, y ne peuvent pas être réglés ou réduire ou forment le nombre vt: est le type: 's' signifie ensemble, «r» signifie réduire
ja: 唯一の例外、ポイントが設定または（V）時に集合の行動として表現されているタイプの生産の数字を引くことができない場合に、Rはマイナスアクションとして表現されている

source: int, position x, which occurs an error
fr: int, la position x, qui se produit une erreur
ja: int型、ルールのx座標とすると、エラーが発生した

source: int, position y, which occurs an error
fr: int, position y, qui se produit une erreur
ja: int型、ルールのy座標は、ときに、エラーが発生

source: int, the number be set or reduced that occurs an error
fr: entier, le nombre être réglé ou réduit qui se produit une erreur
ja: int型、ルールは、エラーが発生したときの設定や数値を減算する

source: char, "s" -- set, "r" -- reduce
fr: char, "s" - ensemble, "r" - réduire

source: An exception When the the record number >= recLimit
fr: Une exception Lorsque le numéro d'enregistrement = recLimit
ja: 一つの例外処理、（デバッグ）recLimitに達した記録を解く場合

source: An exception When the position, checkPos, has been set, and program want to setit
fr: Une exception Lorsque la position, checkPos, a été défini, et le programme veulent SETIT
ja: checkPos設定したとき、これらのポイントが設定されている場合、例外時に座標リスト、[（X1、Y1）、...]、、、それは、このイベントの処理がトリガされます

source: int, position x, when one of the check positions has been set
fr: int, la position x, lorsque l'un des postes de contrôle a été mis en
ja: あなたが設定する点のx座標を確認したいINT、

source: int, position y, when one of the check positions has been set
fr: int, position y, lorsque l'un des postes de contrôle a été mis en
ja: ポイントはy座標をチェックするように設定されているint型、

source: int, the number be set
fr: entier, le nombre sera fixé
ja: int型は、あなたがポイントを確認したいときに設定されている、デジタルのセット

source: Check every number which has been assigned and known as group-number and its effect's boxes' does not have assigned that number"
fr: Vérifiera chaque numéro qui a été attribué et connu sous le nom de groupe et le nombre de boîtes de son effet «ne pas avoir attribué ce numéro "
ja: 彼らはで満たされることが判明しているところからクロスインパクトグループNumerをする場所の下に、それぞれの番号を確認し、あなたが数字を与えるために、残りのポイントを見つけることができれば、それであれば、まだ、デジタルブロックグループを持っていない人あなたは明らかに、この図にこの点を埋めることができ

source: the first number to be checked
fr: le premier nombre à vérifier
ja: チェックされる最初の数に
