Repository: RobertOfTaiwan/SudokuStudyLib
Catalog: docs/source/locale/*/LC_MESSAGES/sudoku.po
Languages: fr, ja

source: bool, False -- check all numbers, True -- check the first number only
fr: bool, Faux - Vérifiez tous les numéros, True - vérifier le premier numéro ne
ja: BOOL、偽：最初の数をチェック：真のすべてのデジタルをチェック

source: Check every line that only have one position for un-assigned number
fr: Vérifiez chaque ligne qui ont une seule position pour le nombre de non affecté
ja: 一点のみがデジタルに充填することができる場合、各グループのx軸またはy軸をチェックする

source: Check every number which has been assigned and its effect's boxes' does not have assigned that number
fr: Vérifiera chaque numéro qui a été attribué et les boîtes de son effet «ne pas avoir attribué ce numéro
ja: 各図、彼らは満たされた着弾位置し、グループ内のこれらのブロックのさらに数からのクロスをチェックして、それであれば、残りの数を与えるためにポイントを見つけることができ、それは明らかであるこれは、この番号にこのポイントを挿入

source: False, check all numbers, True, check the first number only
fr: Faux, consultez tous les numéros, True, consultez le premier numéro ne
ja: FALSE：最初の数がチェックされます。真のすべてのデジタルをチェック

source: compare the result list, to check if there are same result in every step after the last record of original m.rec if same for all emulate result, it means that it must be true, so can do by it
fr: comparer la liste des résultats, afin de vérifier s'il ya même résultat à chaque étape après le dernier enregistrement de m.rec original si même pour tous imiter résultat, cela signifie qu'il doit être vrai, ne peut donc faire par elle
ja: 同じ人が、それはそれぞれの状況が正しいに従うことを望むかもしれない、このアクションが論理的であることが、この結果につながることを意味するのであれば、アクションの最後のレコードの後、元のレコードから各リストを比較し、すべての結果のリストを比較

source: a two dimension list, [[Point, Assigned Number],...]
fr: une liste de dimension deux, [[Point, Numéro attribué], ...]
ja: 二次リスト形式で[[点、割り当てられた番号]、...]

source: Matrix list, the list of Matrix object of emulating results
fr: Liste de Matrix, la liste des objet Matrix des résultats émulant
ja: マトリックス·オブジェクト·リスト、Matrixオブジェクトの各々は、シミュレーション結果を表す

source: tuple, (sets, reduces), sets: the amount of setting, reduces: the amount of reducing
fr: tuple, (jeux, réduit), fixe: le montant de réglage, réduit: le montant de la réduction
ja: タプル、フォーマット（セット、軽減）は、設定しています。設定した合計を、削減します。可能性の総数を削減する

source: emulate the x, y to be set v, then start to use some basic methods to try to solve it will stop when and return:
fr: émuler le x, y être mis en v, puis commencer à utiliser des méthodes de base pour essayer de le résoudre s'arrête quand et retour:
ja: その次の停留所まで塩基性溶液法のいくつかを解決し、状況が発生したときに返すようにして使用を開始後、デジタルvの座標（x、y）点を推測した：

source: 1: one of the targets have been set the checkval
fr: 1: l'un des objectifs ont été fixés le checkval
ja: 1：ターゲットのリストは、ポイントが時間checkvalの数に設定された座標

source: -1: error is True
fr: -1: Erreur est vrai
ja: -1：あなたが数独のルールを破壊した場合

source: 0: all basic methods have been tested, and can't solve
fr: 0: toutes les méthodes de base ont été testés, et ne peuvent pas résoudre
ja: 0：すべての基本的な法律が解決しようとしましたが、まだ解決策を得ることができません

source: and the result matrix
fr: et la matrice de résultat
ja: マトリックス·オブジェクトの後とシミュレーション結果

source: int, the start x position
fr: int, la position de départ x
ja: INT、初期x座標

source: int, the start y position
fr: int, la position de début de y
ja: int型は、出発のy座標

source: int, the number to be emulated be in the (x, y) position
fr: entier, le nombre d'être imité être dans la position (x, y)
ja: int型、座標（x、y）は、デジタルのセットをシミュレートすること指し

source: Point list, tho target list to be checked
fr: Liste de point, la liste cible de Tho à vérifier
ja: ポイントリスト、チェックすべき点のリスト

source: int, when the targets be set, it will check whether the checkval has been assigned in those
fr: int, lorsque les objectifs soient fixés, il va vérifier si le checkval a été attribué dans les
ja: INTは、あなたが目標を設定している場合、いくつかのチェックを設定するには、このパラメータを設定する必要があります

source: tuple, (rtn, matrix, idx)
fr: tuple, (RTN, matrice, idx)
ja: タプル、フォーマット（RTN、マトリックス、IDX）

source: matrix: Matrix, the reulst of emulating
fr: matrix: Matrix, la reulst d'émuler
ja: マトリックス：Matrixオブジェクトのシミュレーション結果

source: idx: int, if the rtn == 1, this will indicate the index of the target that has been assigned the number, checkval
fr: idx: int, si le rtn == 1, cela indique l'indice de la cible qui a été attribué le numéro, checkval
ja: IDX：INTは、RTN== 1の場合、このインデックス値は、この数はcheckvalに設定された1点が示されます

source: When setting a number, may cause 1-3 groups left only one possible position check if a group have only position left, just set it.
fr: Lors de la définition d'un certain nombre, peut entraîner des 1-3 groupes laissé seul possible contrôle de position si un groupe a seulement la position gauche, juste régler.
ja: 数が1点に設定されている場合、1〜3のグループは、それがあれば、直接同じ基本的な人間の本能として設定し、この状態かどうかをチェックします空白部分を残した可能性があります。

source: Matrix Object
fr: Objet Matrix
ja: 数独、オブジェクト全体

source: int, how many last sets want to be checked
fr: int, combien derniers sets veulent être vérifié
ja: INTは、最終的にチェックするためにペンを設定し、どのくらい

source: If the un-assigned positions in a group(line or box) are only one left
fr: Si les positions non assignées à un groupe (ligne ou boîte) sont une seule gauche
ja: グループ内であれば（ラインまたはブロック）のみのブランク点

source: Check every unassigned position, if it's possible numbers left one only WRITEN_POSSIBLE_LIMIT: True, Check position's writen is True or note False, don't check.
fr: Consultez toutes les positions non affecté, si c'est possible numéros gauche on ne WRITEN_POSSIBLE_LIMIT: C'est vrai, Vérifier la writen de position est vraie ou fausse note, ne cochez pas.
ja: 可能な唯一の1のリストの数字かどうかを確認するために、各ポイントブランクチェック。

source: int, the first number of checking
fr: int, le premier numéro de vérification
ja: int型、検査されるべき最初の数字

source: bool, just check the first number or not
fr: bool, il suffit de cocher le premier numéro ou pas
ja: BOOL、最初の数またはすべてをチェック

source: get the possible positions(pos) numbers chain
fr: obtenir les positions possibles de la chaîne (POS) des numéros
ja: どのような空のポイントリスト（POS）から取得した数値は、結合（チェーン）が形成されている

source: lineX or lineY or Box object
fr: LinEx ou Liney ou objet Box
ja: xまたはy軸またはブロックオブジェクト

source: Point list of a group
fr: Liste de points d'un groupe
ja: ポイント·オブジェクト·リストの基

source: int, the amount of the numbers to form a chain
fr: int, la somme des nombres pour former une chaîne
ja: INT、結合（連鎖）のポイントを形成する

source: Chain list
fr: Liste de la chaîne
ja: 結合（連鎖）一覧

source: Guess every possible number in a position by from the min possibles of positions
fr: Devinez chaque nombre possible dans une position par des possibles min de postes
ja: 番号リスト内の各点は、残りの解の数が数独を得ることができることを推測するために一枚ずつ充填することができる、デジタル数充填小児期が最も大きい点を排出推測

source: int, 0 means the new guess, others mean the idx of the possible number of a position
fr: int, 0 signifie que la nouvelle proposition, d'autres signifie la idx du nombre possible d'une position
ja: 整数、0：他の新しい推測を示している：それは推測が、この点は、いくつかの数の最初であり得ることであることを意味

source: when a position(p1) has 2 or more possible numbers, we can emulate every possible number and get its result:
fr: quand une position (p1) dispose de 2 ou plusieurs numéros possibles, nous pouvons imiter chaque nombre possible et obtenir son résultat:
ja: 点（p1）が二つ以上の可能な数を有する場合は、各番号をシミュレートし、シミュレーション結果を得ることができる。

source: if it causes an error, we can reduce that number,
fr: si elle provoque une erreur, nous pouvons réduire ce nombre,
ja: それはエラーを生成した場合、我々は数削減を入れ替えることができます

source: if it can solve the sudoku, we can set this number,
fr: si elle peut résoudre le sudoku, nous pouvons mettre ce nombre,
ja: それは全体の数独のロックを解除することが可能であるならば、我々はこの番号を設定できます。

source: if all possible number can's get condition 1 or 2, we can compare their rec, if they have the same records, we can do it.
fr: si tout nombre possible peut obtenir de l'état 1 ou 2, nous pouvons comparer leur recommandation, si elles ont les mêmes documents, nous pouvons le faire.
ja: ように全ての数は1または2であり得るしないように、我々は、これらのシミュレーションの解決プロセスを比較することができ、それらは、同じ結果を解決する必要がある場合には、それは、このステップは一般的な解決策であることを意味する。

source: when a group(lineX, lineY, Box) has 2 or more position have the same possible number, we can emulate every position to set the number and get its result:
fr: quand un groupe (LinEx, Liney, Box) a deux ou plusieurs positions ont le même nombre possible, nous pouvons imiter toutes les positions pour définir le nombre et obtenir son résultat:
ja: 基（x軸、y軸、ブロック）ときに、特定の数の複数点を充填することができる有する場合には、この図に充填箱点をシミュレートすることができるシミュレーション結果を得た。

source: if it causes an error, we can reduce the position's possible number from that number,
fr: si elle provoque une erreur, nous pouvons réduire le nombre possible de la position de ce nombre,
ja: 我々は排除することができたときにエラーが発生した場合、この数は、この数を指摘するかもしれない

source: if it can solve the sudoku, we can set this number in the position,
fr: si elle peut résoudre le sudoku, nous pouvons mettre ce nombre dans la position,
ja: 我々は時に数独を解くことができれば、我々はこの時点では、この数を設定することができます

source: if all possible position can's get condition 1 or 2, we can compare their rec, if they have the same records, we can do it.
fr: si toutes les positions possibles peut obtenir de l'état 1 ou 2, nous pouvons comparer leur recommandation, si elles ont les mêmes documents, nous pouvons le faire.
ja: 全ての点は、1または2である場合の結果を得ることができない、我々は、彼らが共通の溶液の結果を持っている場合、それはアクションが一般的な解決策であることを意味し、各位置のシミュレーション結果を比較することができ

source: Reduce the possible number in a posiition by GroupNumber
fr: Réduire le nombre possible dans une posiition par GroupNumber
ja: グループ番号は、他のいくつかのポイントをも和らげるには

source: when a position(p1) has two possible numbers only, we can assume if the position is one number(first) then try to emulate to set the position with the other number(second), then see the first number will be filled in a position(p2) which the position can see it if so, we can reduce all these positions which can see p1 and p2 at the same time from the first number
fr: quand une position (p1) ne dispose que de deux nombres possibles, nous pouvons supposer que la position est un nombre (en premier), puis essayer d'imiter pour définir la position de l'autre numéro (deuxième), puis voir le premier numéro sera rempli dans un position (P2) qui la position peut voir si c'est le cas, nous pouvons réduire toutes ces positions qui peuvent voir P1 et P2 dans le même temps du premier numéro
ja: した場合のポイント（P1）のみ2は数、我々は、この点を解決し、これは解決を参照fをシミュレートするために、別の番号（第二組）に設定されている（第1セット）、この時点でいくつかのいずれかをすることを引き受けることができなかったときプロセス、最初の点の交点p1のコロニーが変化することが、このチャタリングが（両方のポイントが表示されている）、ブランクポイントで、最初はこの数が移入さも存在し、缶はできませんこれは、これらの点のいくつかを排除することができる。

source: register all method as an object and save them into a list to return
fr: enregistrer toutes les méthodes comme un objet et de les enregistrer dans une liste de revenir
ja: メソッドの解決に署名すると、すべてのための1であり、呼び出し元に返されるオブジェクトのリストを保存

source: SolveMethod list
fr: liste SolveMethod
ja: オブジェクトリストを解決する方法

source: Check is there an more obvious method for the position, p1 than method1 Obvious methods include fillLastPositionOfGroup=0 and checkObviousNumber=1
fr: Vérifiez est-il un moyen plus simple pour le poste, p1 que method1 méthodes évidentes comprennent fillLastPositionOfGroup = 0 et checkObviousNumber = 1
ja: （P1）の点は、これが数独を解決するために、ビューの人々のポイントを満たすために設定するために、より直感的な方法を指しているかどうかをチェックするために、溶液法への回答を得ることができたとき

source: int, method index
fr: int, l'indice de méthode
ja: INT、優先解法

source: Point, the postion to be checked
fr: Point, la postion à vérifier
ja: ポイント、ポイントをチェックする

source: int, the number to be assigned
fr: entier, le nombre à attribuer
ja: int型、番号が設定される

source: True: set, False: not set
fr: Vrai: ensemble, Faux: pas encore défini
ja: TRUE：セット、偽：設定されていません

source: Solve a sudoku which define in a file!
fr: Résoudre un sudoku qui définissent dans un fichier!
ja: ファイルに定義されている数独を解く！

source: int, the limit for the method loops, 0: no limits
fr: int, la limite de la méthode des boucles, 0: pas de limite
ja: int型、繰り返し回数を制限する法律、0解く：制限なしに

source: int, for debug, when the records >= recLimit, it will stop, 0: no limits
fr: int, pour le débogage, lorsque les dossiers = recLimit, il s'arrête, 0: pas de limites
ja: INT、デバッグ、停止する際に、レコード = recLimit解決した場合、0：制限なし

source: int, for debug, to set the a (x,y) list to check, it will stop when these positions have been set
fr: int, pour le débogage, pour définir la liste a (x, y) pour vérifier, il s'arrête lorsque ces positions ont été mis en
ja: int型、デバッグ、リストが設定されている座標点（x、y）場合、停止

source: int, limit the methods using, 0: no limit, >0: just using the methods which lever < level_limit
fr: int, limiter les méthodes utilisant, 0: pas de limite, 0: juste en utilisant les méthodes levier
ja: int型、メソッド、0を解くことの困難の使用を制限していません。0は制限：このパラメータを使用してメソッドを解決することの難しさのほんの度合いを

source: imt, if using emulator method, this tells the emulator just emulate in emu_limits possible numbers or positions
fr: imt, si en utilisant la méthode de l'émulateur, cela indique l'émulateur juste émuler dans emu_limits nombres possibles ou de positions
ja: あなたは、アナログ方式を使用する場合、IMT、これはシミュレーションを定義するパラメータの数を制限することができる

source: bool, using guess method or not
fr: bool, en utilisant la méthode de deviner ou pas
ja: BOOL、どうか推測

source: bool, using emulator methods or not
fr: bool, en utilisant des méthodes de l'émulateur ou pas
ja: BOOL、シミュレーションを使用するかどうか

source: bool, printing the solving steps of not
fr: bool, imprimer les étapes de résolution de pas
ja: ブール、情報は溶液プロセスで印刷か否か

source: when a method can solve the sudoku
fr: lorsqu'une méthode peut résoudre le sudoku
ja: 溶液法は、この数独を解くことができる場合に

source: when a step will break the rules of sudoku game
fr: quand une étape enfreindre les règles de jeu de sudoku
ja: 解析ステップは、数独のルールに違反する場合には

source: Try Error Method, only fill the first possible position
fr: Essayez la méthode d'erreur, seulement remplir la première position possible
ja: コンピュータを解決するための試行錯誤法は、第一の位置毎に荷受人を呼び出す

source: Matrix object, if it is None, you should give it the sudoku define file
fr: Objet Matrix, si elle est None, vous devriez faire des sudoku définissent fichier
ja: 値がNoneの場合Matrixオブジェクトは、最初のオブジェクトを生成するために、数独行列定義ファイルを指定しなければなりません

source: file, the sudoku define file
fr: fichier, les sudoku définissent fichier
ja: ファイル、数独、初期定義ファイル

source: int, count the call depth of this function
fr: int, compter la profondeur de cette fonction d'appel
ja: int型、関数の数をカウント再帰の深さを有する

source: bool, True if the sudoku has been solved
fr: bool, Vrai si le sudoku a été résolu
ja: BOOL、TRUE：あなたはすでにこの数独ソリューションを持っている場合

source: Update the chain of line return: >=0 means the chain number's amount in the matrix, m
fr: Mettre à jour la chaîne de retour à la ligne: = 0 signifie le montant du numéro de chaîne dans la matrice, m
ja: チェックして、リンクステータスと情報のMatrixオブジェクト（m）を更新し、リンクの総数を得る（=0）。

source: Update the group number, num, in a box, and store those group number in m.n.group list
fr: Mettre à jour le numéro de groupe, numéro, dans une boîte, et stocker les numéro de groupe dans la liste de mngroup
ja: マトリックス·グループ·Numbe（M）内のオブジェクトがある場合は、新しいリストをmngroupする方がある場合は、この番号（数値）を確認し、更新する

source: the number to be updated
fr: le nombre être mis à jour
ja: 数が更新される

source: Update in-direct Group Number, formed by the assigned number and Group Number already known, a recursive function
fr: Mise à jour en direct Nombre de groupe, formé par le numéro attribué et numéro de groupe déjà connu, une fonction récursive
ja: 再帰関数は、位置が再帰的に他のすべての可能なグループ番号に自分自身を識別するために、この番号に電話して、既知のグループ番号の数に記入されています

source: int, the amount of Group Number found
fr: int, le montant de numéro de groupe trouvé
ja: INT、合計が見つかったグループ番号

source: int, the method idx which will be called when it return back to another method
fr: int, la méthode idx qui sera appelée quand il retourne de nouveau à une autre méthode
ja: INT、このメソッドを解決する上で有用であるが解決策は、メソッドを解決し続けるにジャンプした後、

source: int, the pointed number to be checked firstly when it return back to another method
fr: entier, le nombre pointu pour vérifier tout d'abord quand il retourne de nouveau à une autre méthode
ja: あなたが解決策を解決する他の方法の数として数値を指定する場合に有用な方法は、これを解決するint型、

source: bool, just check the first number or not when it return back to another method
fr: bool, il suffit de cocher le premier numéro ou pas quand il retourne de nouveau à une autre méthode
ja: BOOL、ときにソリューションが数を解決するための唯一の他の方法を解決したい場合は、これを解決する便利な方法

source: Write down the possible numbers in every un-assigned position if WRITEN_POSSIBLE_LIMITS has set to 1..9, it will only write down the possibles which <= that limits
fr: Notez les numéros possibles dans chaque position de non affecté si WRITEN_POSSIBLE_LIMITS a mis à 1 .. 9, il ne notez les possibles qui
ja: 定数WRITEN_POSSIBLE_LIMITSは9..1に設定すると、数値はおそらく人々のように、各ポイントになります

source: 2: isDone
ja: 2：これは解決されている数独
